Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.2.84/include/proc/p32mk0256mcj064.h
extern volatile __IPC12bits_t IPC12bits __asm__ ("IPC12") __attribute__((section("sfrs"), address(0xBF810200)));
extern volatile uint32_t        IPC12CLR __attribute__((section("sfrs"),address(0xBF810204)));
extern volatile uint32_t        IPC12SET __attribute__((section("sfrs"),address(0xBF810208)));
extern volatile uint32_t        IPC12INV __attribute__((section("sfrs"),address(0xBF81020C)));
#define IPC13 IPC13
extern volatile uint32_t   IPC13 __attribute__((section("sfrs"), address(0xBF810210)));
typedef union {
  struct {
    uint32_t :8;
    uint32_t SPI2EIS:2;
    uint32_t SPI2EIP:3;
    uint32_t :3;
    uint32_t SPI2RXIS:2;
    uint32_t SPI2RXIP:3;
    uint32_t :3;
    uint32_t SPI2TXIS:2;
    uint32_t SPI2TXIP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC13bits_t;
extern volatile __IPC13bits_t IPC13bits __asm__ ("IPC13") __attribute__((section("sfrs"), address(0xBF810210)));
extern volatile uint32_t        IPC13CLR __attribute__((section("sfrs"),address(0xBF810214)));
extern volatile uint32_t        IPC13SET __attribute__((section("sfrs"),address(0xBF810218)));
extern volatile uint32_t        IPC13INV __attribute__((section("sfrs"),address(0xBF81021C)));
#define IPC14 IPC14
extern volatile uint32_t   IPC14 __attribute__((section("sfrs"), address(0xBF810220)));
typedef union {
  struct {
    uint32_t U2EIS:2;
    uint32_t U2EIP:3;
    uint32_t :3;
    uint32_t U2RXIS:2;
    uint32_t U2RXIP:3;
    uint32_t :3;
    uint32_t U2TXIS:2;
    uint32_t U2TXIP:3;
    uint32_t :3;
    uint32_t I2C2BIS:2;
    uint32_t I2C2BIP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC14bits_t;
extern volatile __IPC14bits_t IPC14bits __asm__ ("IPC14") __attribute__((section("sfrs"), address(0xBF810220)));
extern volatile uint32_t        IPC14CLR __attribute__((section("sfrs"),address(0xBF810224)));
extern volatile uint32_t        IPC14SET __attribute__((section("sfrs"),address(0xBF810228)));
extern volatile uint32_t        IPC14INV __attribute__((section("sfrs"),address(0xBF81022C)));
#define IPC15 IPC15
extern volatile uint32_t   IPC15 __attribute__((section("sfrs"), address(0xBF810230)));
typedef union {
  struct {
    uint32_t I2C2SIS:2;
    uint32_t I2C2SIP:3;
    uint32_t :3;
    uint32_t I2C2MIS:2;
    uint32_t I2C2MIP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC15bits_t;
extern volatile __IPC15bits_t IPC15bits __asm__ ("IPC15") __attribute__((section("sfrs"), address(0xBF810230)));
extern volatile uint32_t        IPC15CLR __attribute__((section("sfrs"),address(0xBF810234)));
extern volatile uint32_t        IPC15SET __attribute__((section("sfrs"),address(0xBF810238)));
extern volatile uint32_t        IPC15INV __attribute__((section("sfrs"),address(0xBF81023C)));
#define IPC17 IPC17
extern volatile uint32_t   IPC17 __attribute__((section("sfrs"), address(0xBF810250)));
typedef union {
  struct {
    uint32_t :24;
    uint32_t CTMUIS:2;
    uint32_t CTMUIP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC17bits_t;
extern volatile __IPC17bits_t IPC17bits __asm__ ("IPC17") __attribute__((section("sfrs"), address(0xBF810250)));
extern volatile uint32_t        IPC17CLR __attribute__((section("sfrs"),address(0xBF810254)));
extern volatile uint32_t        IPC17SET __attribute__((section("sfrs"),address(0xBF810258)));
extern volatile uint32_t        IPC17INV __attribute__((section("sfrs"),address(0xBF81025C)));
#define IPC18 IPC18
extern volatile uint32_t   IPC18 __attribute__((section("sfrs"), address(0xBF810260)));
typedef union {
  struct {
    uint32_t DMA0IS:2;
    uint32_t DMA0IP:3;
    uint32_t :3;
    uint32_t DMA1IS:2;
    uint32_t DMA1IP:3;
    uint32_t :3;
    uint32_t DMA2IS:2;
    uint32_t DMA2IP:3;
    uint32_t :3;
    uint32_t DMA3IS:2;
    uint32_t DMA3IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC18bits_t;
extern volatile __IPC18bits_t IPC18bits __asm__ ("IPC18") __attribute__((section("sfrs"), address(0xBF810260)));
extern volatile uint32_t        IPC18CLR __attribute__((section("sfrs"),address(0xBF810264)));
extern volatile uint32_t        IPC18SET __attribute__((section("sfrs"),address(0xBF810268)));
extern volatile uint32_t        IPC18INV __attribute__((section("sfrs"),address(0xBF81026C)));
#define IPC19 IPC19
extern volatile uint32_t   IPC19 __attribute__((section("sfrs"), address(0xBF810270)));
typedef union {
  struct {
    uint32_t T6IS:2;
    uint32_t T6IP:3;
    uint32_t :3;
    uint32_t IC6EIS:2;
    uint32_t IC6EIP:3;
    uint32_t :3;
    uint32_t IC6IS:2;
    uint32_t IC6IP:3;
    uint32_t :3;
    uint32_t OC6IS:2;
    uint32_t OC6IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC19bits_t;
extern volatile __IPC19bits_t IPC19bits __asm__ ("IPC19") __attribute__((section("sfrs"), address(0xBF810270)));
extern volatile uint32_t        IPC19CLR __attribute__((section("sfrs"),address(0xBF810274)));
extern volatile uint32_t        IPC19SET __attribute__((section("sfrs"),address(0xBF810278)));
extern volatile uint32_t        IPC19INV __attribute__((section("sfrs"),address(0xBF81027C)));
#define IPC20 IPC20
extern volatile uint32_t   IPC20 __attribute__((section("sfrs"), address(0xBF810280)));
typedef union {
  struct {
    uint32_t T7IS:2;
    uint32_t T7IP:3;
    uint32_t :3;
    uint32_t IC7EIS:2;
    uint32_t IC7EIP:3;
    uint32_t :3;
    uint32_t IC7IS:2;
    uint32_t IC7IP:3;
    uint32_t :3;
    uint32_t OC7IS:2;
    uint32_t OC7IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC20bits_t;
extern volatile __IPC20bits_t IPC20bits __asm__ ("IPC20") __attribute__((section("sfrs"), address(0xBF810280)));
extern volatile uint32_t        IPC20CLR __attribute__((section("sfrs"),address(0xBF810284)));
extern volatile uint32_t        IPC20SET __attribute__((section("sfrs"),address(0xBF810288)));
extern volatile uint32_t        IPC20INV __attribute__((section("sfrs"),address(0xBF81028C)));
#define IPC21 IPC21
extern volatile uint32_t   IPC21 __attribute__((section("sfrs"), address(0xBF810290)));
typedef union {
  struct {
    uint32_t T8IS:2;
    uint32_t T8IP:3;
    uint32_t :3;
    uint32_t IC8EIS:2;
    uint32_t IC8EIP:3;
    uint32_t :3;
    uint32_t IC8IS:2;
    uint32_t IC8IP:3;
    uint32_t :3;
    uint32_t OC8IS:2;
    uint32_t OC8IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC21bits_t;
