Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.2.84/include/proc/p32mk0256mcj064.h
extern volatile __OFF171bits_t OFF171bits __asm__ ("OFF171") __attribute__((section("sfrs"), address(0xBF8107EC)));
#define OFF172 OFF172
extern volatile uint32_t   OFF172 __attribute__((section("sfrs"), address(0xBF8107F0)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF172bits_t;
extern volatile __OFF172bits_t OFF172bits __asm__ ("OFF172") __attribute__((section("sfrs"), address(0xBF8107F0)));
#define OFF173 OFF173
extern volatile uint32_t   OFF173 __attribute__((section("sfrs"), address(0xBF8107F4)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF173bits_t;
extern volatile __OFF173bits_t OFF173bits __asm__ ("OFF173") __attribute__((section("sfrs"), address(0xBF8107F4)));
#define OFF174 OFF174
extern volatile uint32_t   OFF174 __attribute__((section("sfrs"), address(0xBF8107F8)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF174bits_t;
extern volatile __OFF174bits_t OFF174bits __asm__ ("OFF174") __attribute__((section("sfrs"), address(0xBF8107F8)));
#define OFF175 OFF175
extern volatile uint32_t   OFF175 __attribute__((section("sfrs"), address(0xBF8107FC)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF175bits_t;
extern volatile __OFF175bits_t OFF175bits __asm__ ("OFF175") __attribute__((section("sfrs"), address(0xBF8107FC)));
#define OFF176 OFF176
extern volatile uint32_t   OFF176 __attribute__((section("sfrs"), address(0xBF810800)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF176bits_t;
extern volatile __OFF176bits_t OFF176bits __asm__ ("OFF176") __attribute__((section("sfrs"), address(0xBF810800)));
#define OFF177 OFF177
extern volatile uint32_t   OFF177 __attribute__((section("sfrs"), address(0xBF810804)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF177bits_t;
extern volatile __OFF177bits_t OFF177bits __asm__ ("OFF177") __attribute__((section("sfrs"), address(0xBF810804)));
#define OFF178 OFF178
extern volatile uint32_t   OFF178 __attribute__((section("sfrs"), address(0xBF810808)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF178bits_t;
extern volatile __OFF178bits_t OFF178bits __asm__ ("OFF178") __attribute__((section("sfrs"), address(0xBF810808)));
#define OFF182 OFF182
extern volatile uint32_t   OFF182 __attribute__((section("sfrs"), address(0xBF810818)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF182bits_t;
extern volatile __OFF182bits_t OFF182bits __asm__ ("OFF182") __attribute__((section("sfrs"), address(0xBF810818)));
#define OFF183 OFF183
extern volatile uint32_t   OFF183 __attribute__((section("sfrs"), address(0xBF81081C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF183bits_t;
extern volatile __OFF183bits_t OFF183bits __asm__ ("OFF183") __attribute__((section("sfrs"), address(0xBF81081C)));
#define OFF184 OFF184
extern volatile uint32_t   OFF184 __attribute__((section("sfrs"), address(0xBF810820)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF184bits_t;
extern volatile __OFF184bits_t OFF184bits __asm__ ("OFF184") __attribute__((section("sfrs"), address(0xBF810820)));
#define OFF185 OFF185
extern volatile uint32_t   OFF185 __attribute__((section("sfrs"), address(0xBF810824)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF185bits_t;
extern volatile __OFF185bits_t OFF185bits __asm__ ("OFF185") __attribute__((section("sfrs"), address(0xBF810824)));
#define OFF189 OFF189
extern volatile uint32_t   OFF189 __attribute__((section("sfrs"), address(0xBF810834)));
#define OFF230 OFF230
extern volatile uint32_t   OFF230 __attribute__((section("sfrs"), address(0xBF8108D8)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF230bits_t;
extern volatile __OFF230bits_t OFF230bits __asm__ ("OFF230") __attribute__((section("sfrs"), address(0xBF8108D8)));
#define OFF238 OFF238
extern volatile uint32_t   OFF238 __attribute__((section("sfrs"), address(0xBF8108F8)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF238bits_t;
extern volatile __OFF238bits_t OFF238bits __asm__ ("OFF238") __attribute__((section("sfrs"), address(0xBF8108F8)));
#define OFF239 OFF239
extern volatile uint32_t   OFF239 __attribute__((section("sfrs"), address(0xBF8108FC)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF239bits_t;
extern volatile __OFF239bits_t OFF239bits __asm__ ("OFF239") __attribute__((section("sfrs"), address(0xBF8108FC)));
#define OFF240 OFF240
extern volatile uint32_t   OFF240 __attribute__((section("sfrs"), address(0xBF810900)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF240bits_t;
extern volatile __OFF240bits_t OFF240bits __asm__ ("OFF240") __attribute__((section("sfrs"), address(0xBF810900)));
#define OFF245 OFF245
extern volatile uint32_t   OFF245 __attribute__((section("sfrs"), address(0xBF810914)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF245bits_t;
extern volatile __OFF245bits_t OFF245bits __asm__ ("OFF245") __attribute__((section("sfrs"), address(0xBF810914)));
#define OFF246 OFF246
extern volatile uint32_t   OFF246 __attribute__((section("sfrs"), address(0xBF810918)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF246bits_t;
extern volatile __OFF246bits_t OFF246bits __asm__ ("OFF246") __attribute__((section("sfrs"), address(0xBF810918)));
#define OFF247 OFF247
extern volatile uint32_t   OFF247 __attribute__((section("sfrs"), address(0xBF81091C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF247bits_t;
extern volatile __OFF247bits_t OFF247bits __asm__ ("OFF247") __attribute__((section("sfrs"), address(0xBF81091C)));
#define OFF249 OFF249
extern volatile uint32_t   OFF249 __attribute__((section("sfrs"), address(0xBF810924)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF249bits_t;
extern volatile __OFF249bits_t OFF249bits __asm__ ("OFF249") __attribute__((section("sfrs"), address(0xBF810924)));
#define OFF250 OFF250
extern volatile uint32_t   OFF250 __attribute__((section("sfrs"), address(0xBF810928)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF250bits_t;
