Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.2.84/include/proc/p32mk0256mcj064.h
extern volatile __CNNEEbits_t CNNEEbits __asm__ ("CNNEE") __attribute__((section("sfrs"), address(0xBF8604A0)));
extern volatile uint32_t        CNNEECLR __attribute__((section("sfrs"),address(0xBF8604A4)));
extern volatile uint32_t        CNNEESET __attribute__((section("sfrs"),address(0xBF8604A8)));
extern volatile uint32_t        CNNEEINV __attribute__((section("sfrs"),address(0xBF8604AC)));
#define CNFE CNFE
extern volatile uint32_t   CNFE __attribute__((section("sfrs"), address(0xBF8604B0)));
typedef struct {
  uint32_t CNFE0:1;
  uint32_t CNFE1:1;
  uint32_t :6;
  uint32_t CNFE8:1;
  uint32_t CNFE9:1;
  uint32_t :2;
  uint32_t CNFE12:1;
  uint32_t CNFE13:1;
  uint32_t CNFE14:1;
  uint32_t CNFE15:1;
} __CNFEbits_t;
extern volatile __CNFEbits_t CNFEbits __asm__ ("CNFE") __attribute__((section("sfrs"), address(0xBF8604B0)));
extern volatile uint32_t        CNFECLR __attribute__((section("sfrs"),address(0xBF8604B4)));
extern volatile uint32_t        CNFESET __attribute__((section("sfrs"),address(0xBF8604B8)));
extern volatile uint32_t        CNFEINV __attribute__((section("sfrs"),address(0xBF8604BC)));
#define SRCON0E SRCON0E
extern volatile uint32_t   SRCON0E __attribute__((section("sfrs"), address(0xBF8604C0)));
typedef struct {
  uint32_t :12;
  uint32_t SR0E12:1;
  uint32_t SR0E13:1;
  uint32_t SR0E14:1;
  uint32_t SR0E15:1;
} __SRCON0Ebits_t;
extern volatile __SRCON0Ebits_t SRCON0Ebits __asm__ ("SRCON0E") __attribute__((section("sfrs"), address(0xBF8604C0)));
extern volatile uint32_t        SRCON0ECLR __attribute__((section("sfrs"),address(0xBF8604C4)));
extern volatile uint32_t        SRCON0ESET __attribute__((section("sfrs"),address(0xBF8604C8)));
extern volatile uint32_t        SRCON0EINV __attribute__((section("sfrs"),address(0xBF8604CC)));
#define SRCON1E SRCON1E
extern volatile uint32_t   SRCON1E __attribute__((section("sfrs"), address(0xBF8604D0)));
typedef struct {
  uint32_t :12;
  uint32_t SR1E12:1;
  uint32_t SR1E13:1;
  uint32_t SR1E14:1;
  uint32_t SR1E15:1;
} __SRCON1Ebits_t;
extern volatile __SRCON1Ebits_t SRCON1Ebits __asm__ ("SRCON1E") __attribute__((section("sfrs"), address(0xBF8604D0)));
extern volatile uint32_t        SRCON1ECLR __attribute__((section("sfrs"),address(0xBF8604D4)));
extern volatile uint32_t        SRCON1ESET __attribute__((section("sfrs"),address(0xBF8604D8)));
extern volatile uint32_t        SRCON1EINV __attribute__((section("sfrs"),address(0xBF8604DC)));
#define TRISF TRISF
extern volatile uint32_t   TRISF __attribute__((section("sfrs"), address(0xBF860510)));
typedef union {
  struct {
    uint32_t TRISF0:1;
    uint32_t TRISF1:1;
    uint32_t :3;
    uint32_t TRISF5:1;
    uint32_t TRISF6:1;
    uint32_t TRISF7:1;
    uint32_t :1;
    uint32_t TRISF9:1;
    uint32_t TRISF10:1;
    uint32_t :1;
    uint32_t TRISF12:1;
    uint32_t TRISF13:1;
  };
  struct {
    uint32_t w:32;
  };
} __TRISFbits_t;
extern volatile __TRISFbits_t TRISFbits __asm__ ("TRISF") __attribute__((section("sfrs"), address(0xBF860510)));
extern volatile uint32_t        TRISFCLR __attribute__((section("sfrs"),address(0xBF860514)));
extern volatile uint32_t        TRISFSET __attribute__((section("sfrs"),address(0xBF860518)));
extern volatile uint32_t        TRISFINV __attribute__((section("sfrs"),address(0xBF86051C)));
#define PORTF PORTF
extern volatile uint32_t   PORTF __attribute__((section("sfrs"), address(0xBF860520)));
typedef union {
  struct {
    uint32_t RF0:1;
    uint32_t RF1:1;
    uint32_t :3;
    uint32_t RF5:1;
    uint32_t RF6:1;
    uint32_t RF7:1;
    uint32_t :1;
    uint32_t RF9:1;
    uint32_t RF10:1;
    uint32_t :1;
    uint32_t RF12:1;
    uint32_t RF13:1;
  };
  struct {
    uint32_t w:32;
  };
} __PORTFbits_t;
extern volatile __PORTFbits_t PORTFbits __asm__ ("PORTF") __attribute__((section("sfrs"), address(0xBF860520)));
extern volatile uint32_t        PORTFCLR __attribute__((section("sfrs"),address(0xBF860524)));
extern volatile uint32_t        PORTFSET __attribute__((section("sfrs"),address(0xBF860528)));
extern volatile uint32_t        PORTFINV __attribute__((section("sfrs"),address(0xBF86052C)));
#define LATF LATF
extern volatile uint32_t   LATF __attribute__((section("sfrs"), address(0xBF860530)));
typedef union {
  struct {
    uint32_t LATF0:1;
    uint32_t LATF1:1;
    uint32_t :3;
    uint32_t LATF5:1;
    uint32_t LATF6:1;
    uint32_t LATF7:1;
    uint32_t :1;
    uint32_t LATF9:1;
    uint32_t LATF10:1;
    uint32_t :1;
    uint32_t LATF12:1;
    uint32_t LATF13:1;
  };
  struct {
    uint32_t w:32;
  };
} __LATFbits_t;
extern volatile __LATFbits_t LATFbits __asm__ ("LATF") __attribute__((section("sfrs"), address(0xBF860530)));
extern volatile uint32_t        LATFCLR __attribute__((section("sfrs"),address(0xBF860534)));
extern volatile uint32_t        LATFSET __attribute__((section("sfrs"),address(0xBF860538)));
extern volatile uint32_t        LATFINV __attribute__((section("sfrs"),address(0xBF86053C)));
#define ODCF ODCF
extern volatile uint32_t   ODCF __attribute__((section("sfrs"), address(0xBF860540)));
typedef union {
  struct {
    uint32_t ODCF0:1;
    uint32_t ODCF1:1;
    uint32_t :3;
    uint32_t ODCF5:1;
    uint32_t ODCF6:1;
    uint32_t ODCF7:1;
    uint32_t :1;
    uint32_t ODCF9:1;
    uint32_t ODCF10:1;
    uint32_t :1;
    uint32_t ODCF12:1;
    uint32_t ODCF13:1;
  };
  struct {
    uint32_t w:32;
  };
} __ODCFbits_t;
extern volatile __ODCFbits_t ODCFbits __asm__ ("ODCF") __attribute__((section("sfrs"), address(0xBF860540)));
extern volatile uint32_t        ODCFCLR __attribute__((section("sfrs"),address(0xBF860544)));
extern volatile uint32_t        ODCFSET __attribute__((section("sfrs"),address(0xBF860548)));
extern volatile uint32_t        ODCFINV __attribute__((section("sfrs"),address(0xBF86054C)));
#define CNPUF CNPUF
extern volatile uint32_t   CNPUF __attribute__((section("sfrs"), address(0xBF860550)));
typedef union {
  struct {
    uint32_t CNPUF0:1;
    uint32_t CNPUF1:1;
    uint32_t :3;
    uint32_t CNPUF5:1;
    uint32_t CNPUF6:1;
    uint32_t CNPUF7:1;
    uint32_t :1;
    uint32_t CNPUF9:1;
    uint32_t CNPUF10:1;
    uint32_t :1;
    uint32_t CNPUF12:1;
    uint32_t CNPUF13:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPUFbits_t;
extern volatile __CNPUFbits_t CNPUFbits __asm__ ("CNPUF") __attribute__((section("sfrs"), address(0xBF860550)));
extern volatile uint32_t        CNPUFCLR __attribute__((section("sfrs"),address(0xBF860554)));
extern volatile uint32_t        CNPUFSET __attribute__((section("sfrs"),address(0xBF860558)));
extern volatile uint32_t        CNPUFINV __attribute__((section("sfrs"),address(0xBF86055C)));
#define CNPDF CNPDF
extern volatile uint32_t   CNPDF __attribute__((section("sfrs"), address(0xBF860560)));
typedef union {
  struct {
    uint32_t CNPDF0:1;
    uint32_t CNPDF1:1;
    uint32_t :3;
    uint32_t CNPDF5:1;
    uint32_t CNPDF6:1;
    uint32_t CNPDF7:1;
    uint32_t :1;
    uint32_t CNPDF9:1;
    uint32_t CNPDF10:1;
    uint32_t :1;
    uint32_t CNPDF12:1;
    uint32_t CNPDF13:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPDFbits_t;
extern volatile __CNPDFbits_t CNPDFbits __asm__ ("CNPDF") __attribute__((section("sfrs"), address(0xBF860560)));
extern volatile uint32_t        CNPDFCLR __attribute__((section("sfrs"),address(0xBF860564)));
extern volatile uint32_t        CNPDFSET __attribute__((section("sfrs"),address(0xBF860568)));
extern volatile uint32_t        CNPDFINV __attribute__((section("sfrs"),address(0xBF86056C)));
#define CNCONF CNCONF
extern volatile uint32_t   CNCONF __attribute__((section("sfrs"), address(0xBF860570)));
typedef union {
  struct {
    uint32_t :11;
    uint32_t EDGEDETECT:1;
    uint32_t :3;
    uint32_t ON:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNCONFbits_t;
extern volatile __CNCONFbits_t CNCONFbits __asm__ ("CNCONF") __attribute__((section("sfrs"), address(0xBF860570)));
extern volatile uint32_t        CNCONFCLR __attribute__((section("sfrs"),address(0xBF860574)));
extern volatile uint32_t        CNCONFSET __attribute__((section("sfrs"),address(0xBF860578)));
extern volatile uint32_t        CNCONFINV __attribute__((section("sfrs"),address(0xBF86057C)));
#define CNENF CNENF
extern volatile uint32_t   CNENF __attribute__((section("sfrs"), address(0xBF860580)));
typedef union {
  struct {
    uint32_t CNIEF0:1;
    uint32_t CNIEF1:1;
    uint32_t :3;
    uint32_t CNIEF5:1;
    uint32_t CNIEF6:1;
    uint32_t CNIEF7:1;
    uint32_t :1;
    uint32_t CNIEF9:1;
    uint32_t CNIEF10:1;
    uint32_t :1;
    uint32_t CNIEF12:1;
    uint32_t CNIEF13:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNENFbits_t;
