Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.2.84/include/proc/p32mk0256mcj064.h
extern volatile __CFD1MASK9bits_t CFD1MASK9bits __asm__ ("CFD1MASK9") __attribute__((section("sfrs"), address(0xBF8808F0)));
extern volatile uint32_t        CFD1MASK9CLR __attribute__((section("sfrs"),address(0xBF8808F4)));
extern volatile uint32_t        CFD1MASK9SET __attribute__((section("sfrs"),address(0xBF8808F8)));
extern volatile uint32_t        CFD1MASK9INV __attribute__((section("sfrs"),address(0xBF8808FC)));
#define CFD1FLTOBJ10 CFD1FLTOBJ10
extern volatile uint32_t   CFD1FLTOBJ10 __attribute__((section("sfrs"), address(0xBF880900)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD1FLTOBJ10bits_t;
extern volatile __CFD1FLTOBJ10bits_t CFD1FLTOBJ10bits __asm__ ("CFD1FLTOBJ10") __attribute__((section("sfrs"), address(0xBF880900)));
extern volatile uint32_t        CFD1FLTOBJ10CLR __attribute__((section("sfrs"),address(0xBF880904)));
extern volatile uint32_t        CFD1FLTOBJ10SET __attribute__((section("sfrs"),address(0xBF880908)));
extern volatile uint32_t        CFD1FLTOBJ10INV __attribute__((section("sfrs"),address(0xBF88090C)));
#define CFD1MASK10 CFD1MASK10
extern volatile uint32_t   CFD1MASK10 __attribute__((section("sfrs"), address(0xBF880910)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD1MASK10bits_t;
extern volatile __CFD1MASK10bits_t CFD1MASK10bits __asm__ ("CFD1MASK10") __attribute__((section("sfrs"), address(0xBF880910)));
extern volatile uint32_t        CFD1MASK10CLR __attribute__((section("sfrs"),address(0xBF880914)));
extern volatile uint32_t        CFD1MASK10SET __attribute__((section("sfrs"),address(0xBF880918)));
extern volatile uint32_t        CFD1MASK10INV __attribute__((section("sfrs"),address(0xBF88091C)));
#define CFD1FLTOBJ11 CFD1FLTOBJ11
extern volatile uint32_t   CFD1FLTOBJ11 __attribute__((section("sfrs"), address(0xBF880920)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD1FLTOBJ11bits_t;
extern volatile __CFD1FLTOBJ11bits_t CFD1FLTOBJ11bits __asm__ ("CFD1FLTOBJ11") __attribute__((section("sfrs"), address(0xBF880920)));
extern volatile uint32_t        CFD1FLTOBJ11CLR __attribute__((section("sfrs"),address(0xBF880924)));
extern volatile uint32_t        CFD1FLTOBJ11SET __attribute__((section("sfrs"),address(0xBF880928)));
extern volatile uint32_t        CFD1FLTOBJ11INV __attribute__((section("sfrs"),address(0xBF88092C)));
#define CFD1MASK11 CFD1MASK11
extern volatile uint32_t   CFD1MASK11 __attribute__((section("sfrs"), address(0xBF880930)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD1MASK11bits_t;
extern volatile __CFD1MASK11bits_t CFD1MASK11bits __asm__ ("CFD1MASK11") __attribute__((section("sfrs"), address(0xBF880930)));
extern volatile uint32_t        CFD1MASK11CLR __attribute__((section("sfrs"),address(0xBF880934)));
extern volatile uint32_t        CFD1MASK11SET __attribute__((section("sfrs"),address(0xBF880938)));
extern volatile uint32_t        CFD1MASK11INV __attribute__((section("sfrs"),address(0xBF88093C)));
#define CFD1FLTOBJ12 CFD1FLTOBJ12
extern volatile uint32_t   CFD1FLTOBJ12 __attribute__((section("sfrs"), address(0xBF880940)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD1FLTOBJ12bits_t;
extern volatile __CFD1FLTOBJ12bits_t CFD1FLTOBJ12bits __asm__ ("CFD1FLTOBJ12") __attribute__((section("sfrs"), address(0xBF880940)));
extern volatile uint32_t        CFD1FLTOBJ12CLR __attribute__((section("sfrs"),address(0xBF880944)));
extern volatile uint32_t        CFD1FLTOBJ12SET __attribute__((section("sfrs"),address(0xBF880948)));
extern volatile uint32_t        CFD1FLTOBJ12INV __attribute__((section("sfrs"),address(0xBF88094C)));
#define CFD1MASK12 CFD1MASK12
extern volatile uint32_t   CFD1MASK12 __attribute__((section("sfrs"), address(0xBF880950)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD1MASK12bits_t;
extern volatile __CFD1MASK12bits_t CFD1MASK12bits __asm__ ("CFD1MASK12") __attribute__((section("sfrs"), address(0xBF880950)));
extern volatile uint32_t        CFD1MASK12CLR __attribute__((section("sfrs"),address(0xBF880954)));
extern volatile uint32_t        CFD1MASK12SET __attribute__((section("sfrs"),address(0xBF880958)));
extern volatile uint32_t        CFD1MASK12INV __attribute__((section("sfrs"),address(0xBF88095C)));
#define CFD1FLTOBJ13 CFD1FLTOBJ13
extern volatile uint32_t   CFD1FLTOBJ13 __attribute__((section("sfrs"), address(0xBF880960)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD1FLTOBJ13bits_t;
extern volatile __CFD1FLTOBJ13bits_t CFD1FLTOBJ13bits __asm__ ("CFD1FLTOBJ13") __attribute__((section("sfrs"), address(0xBF880960)));
extern volatile uint32_t        CFD1FLTOBJ13CLR __attribute__((section("sfrs"),address(0xBF880964)));
extern volatile uint32_t        CFD1FLTOBJ13SET __attribute__((section("sfrs"),address(0xBF880968)));
extern volatile uint32_t        CFD1FLTOBJ13INV __attribute__((section("sfrs"),address(0xBF88096C)));
#define CFD1MASK13 CFD1MASK13
extern volatile uint32_t   CFD1MASK13 __attribute__((section("sfrs"), address(0xBF880970)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD1MASK13bits_t;
extern volatile __CFD1MASK13bits_t CFD1MASK13bits __asm__ ("CFD1MASK13") __attribute__((section("sfrs"), address(0xBF880970)));
extern volatile uint32_t        CFD1MASK13CLR __attribute__((section("sfrs"),address(0xBF880974)));
extern volatile uint32_t        CFD1MASK13SET __attribute__((section("sfrs"),address(0xBF880978)));
extern volatile uint32_t        CFD1MASK13INV __attribute__((section("sfrs"),address(0xBF88097C)));
#define CFD1FLTOBJ14 CFD1FLTOBJ14
extern volatile uint32_t   CFD1FLTOBJ14 __attribute__((section("sfrs"), address(0xBF880980)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD1FLTOBJ14bits_t;
