Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.2.84/include/proc/p32mk0256mcj064.h
extern volatile __CFD1MASK25bits_t CFD1MASK25bits __asm__ ("CFD1MASK25") __attribute__((section("sfrs"), address(0xBF880AF0)));
extern volatile uint32_t        CFD1MASK25CLR __attribute__((section("sfrs"),address(0xBF880AF4)));
extern volatile uint32_t        CFD1MASK25SET __attribute__((section("sfrs"),address(0xBF880AF8)));
extern volatile uint32_t        CFD1MASK25INV __attribute__((section("sfrs"),address(0xBF880AFC)));
#define CFD1FLTOBJ26 CFD1FLTOBJ26
extern volatile uint32_t   CFD1FLTOBJ26 __attribute__((section("sfrs"), address(0xBF880B00)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD1FLTOBJ26bits_t;
extern volatile __CFD1FLTOBJ26bits_t CFD1FLTOBJ26bits __asm__ ("CFD1FLTOBJ26") __attribute__((section("sfrs"), address(0xBF880B00)));
extern volatile uint32_t        CFD1FLTOBJ26CLR __attribute__((section("sfrs"),address(0xBF880B04)));
extern volatile uint32_t        CFD1FLTOBJ26SET __attribute__((section("sfrs"),address(0xBF880B08)));
extern volatile uint32_t        CFD1FLTOBJ26INV __attribute__((section("sfrs"),address(0xBF880B0C)));
#define CFD1MASK26 CFD1MASK26
extern volatile uint32_t   CFD1MASK26 __attribute__((section("sfrs"), address(0xBF880B10)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD1MASK26bits_t;
extern volatile __CFD1MASK26bits_t CFD1MASK26bits __asm__ ("CFD1MASK26") __attribute__((section("sfrs"), address(0xBF880B10)));
extern volatile uint32_t        CFD1MASK26CLR __attribute__((section("sfrs"),address(0xBF880B14)));
extern volatile uint32_t        CFD1MASK26SET __attribute__((section("sfrs"),address(0xBF880B18)));
extern volatile uint32_t        CFD1MASK26INV __attribute__((section("sfrs"),address(0xBF880B1C)));
#define CFD1FLTOBJ27 CFD1FLTOBJ27
extern volatile uint32_t   CFD1FLTOBJ27 __attribute__((section("sfrs"), address(0xBF880B20)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD1FLTOBJ27bits_t;
extern volatile __CFD1FLTOBJ27bits_t CFD1FLTOBJ27bits __asm__ ("CFD1FLTOBJ27") __attribute__((section("sfrs"), address(0xBF880B20)));
extern volatile uint32_t        CFD1FLTOBJ27CLR __attribute__((section("sfrs"),address(0xBF880B24)));
extern volatile uint32_t        CFD1FLTOBJ27SET __attribute__((section("sfrs"),address(0xBF880B28)));
extern volatile uint32_t        CFD1FLTOBJ27INV __attribute__((section("sfrs"),address(0xBF880B2C)));
#define CFD1MASK27 CFD1MASK27
extern volatile uint32_t   CFD1MASK27 __attribute__((section("sfrs"), address(0xBF880B30)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD1MASK27bits_t;
extern volatile __CFD1MASK27bits_t CFD1MASK27bits __asm__ ("CFD1MASK27") __attribute__((section("sfrs"), address(0xBF880B30)));
extern volatile uint32_t        CFD1MASK27CLR __attribute__((section("sfrs"),address(0xBF880B34)));
extern volatile uint32_t        CFD1MASK27SET __attribute__((section("sfrs"),address(0xBF880B38)));
extern volatile uint32_t        CFD1MASK27INV __attribute__((section("sfrs"),address(0xBF880B3C)));
#define CFD1FLTOBJ28 CFD1FLTOBJ28
extern volatile uint32_t   CFD1FLTOBJ28 __attribute__((section("sfrs"), address(0xBF880B40)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD1FLTOBJ28bits_t;
extern volatile __CFD1FLTOBJ28bits_t CFD1FLTOBJ28bits __asm__ ("CFD1FLTOBJ28") __attribute__((section("sfrs"), address(0xBF880B40)));
extern volatile uint32_t        CFD1FLTOBJ28CLR __attribute__((section("sfrs"),address(0xBF880B44)));
extern volatile uint32_t        CFD1FLTOBJ28SET __attribute__((section("sfrs"),address(0xBF880B48)));
extern volatile uint32_t        CFD1FLTOBJ28INV __attribute__((section("sfrs"),address(0xBF880B4C)));
#define CFD1MASK28 CFD1MASK28
extern volatile uint32_t   CFD1MASK28 __attribute__((section("sfrs"), address(0xBF880B50)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD1MASK28bits_t;
extern volatile __CFD1MASK28bits_t CFD1MASK28bits __asm__ ("CFD1MASK28") __attribute__((section("sfrs"), address(0xBF880B50)));
extern volatile uint32_t        CFD1MASK28CLR __attribute__((section("sfrs"),address(0xBF880B54)));
extern volatile uint32_t        CFD1MASK28SET __attribute__((section("sfrs"),address(0xBF880B58)));
extern volatile uint32_t        CFD1MASK28INV __attribute__((section("sfrs"),address(0xBF880B5C)));
#define CFD1FLTOBJ29 CFD1FLTOBJ29
extern volatile uint32_t   CFD1FLTOBJ29 __attribute__((section("sfrs"), address(0xBF880B60)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD1FLTOBJ29bits_t;
extern volatile __CFD1FLTOBJ29bits_t CFD1FLTOBJ29bits __asm__ ("CFD1FLTOBJ29") __attribute__((section("sfrs"), address(0xBF880B60)));
extern volatile uint32_t        CFD1FLTOBJ29CLR __attribute__((section("sfrs"),address(0xBF880B64)));
extern volatile uint32_t        CFD1FLTOBJ29SET __attribute__((section("sfrs"),address(0xBF880B68)));
extern volatile uint32_t        CFD1FLTOBJ29INV __attribute__((section("sfrs"),address(0xBF880B6C)));
#define CFD1MASK29 CFD1MASK29
extern volatile uint32_t   CFD1MASK29 __attribute__((section("sfrs"), address(0xBF880B70)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD1MASK29bits_t;
extern volatile __CFD1MASK29bits_t CFD1MASK29bits __asm__ ("CFD1MASK29") __attribute__((section("sfrs"), address(0xBF880B70)));
extern volatile uint32_t        CFD1MASK29CLR __attribute__((section("sfrs"),address(0xBF880B74)));
extern volatile uint32_t        CFD1MASK29SET __attribute__((section("sfrs"),address(0xBF880B78)));
extern volatile uint32_t        CFD1MASK29INV __attribute__((section("sfrs"),address(0xBF880B7C)));
#define CFD1FLTOBJ30 CFD1FLTOBJ30
extern volatile uint32_t   CFD1FLTOBJ30 __attribute__((section("sfrs"), address(0xBF880B80)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD1FLTOBJ30bits_t;
