Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.2.84/include/proc/p32mk0256mcj064.h
  .extern DTCOMP9CLR       /* 0xBF82A934 */
  .extern DTCOMP9SET       /* 0xBF82A938 */
  .extern DTCOMP9INV       /* 0xBF82A93C */
  .extern TRIG9            /* 0xBF82A940 */
  .extern TRIG9CLR         /* 0xBF82A944 */
  .extern TRIG9SET         /* 0xBF82A948 */
  .extern TRIG9INV         /* 0xBF82A94C */
  .extern TRGCON9          /* 0xBF82A950 */
  .extern TRGCON9CLR       /* 0xBF82A954 */
  .extern TRGCON9SET       /* 0xBF82A958 */
  .extern TRGCON9INV       /* 0xBF82A95C */
  .extern STRIG9           /* 0xBF82A960 */
  .extern STRIG9CLR        /* 0xBF82A964 */
  .extern STRIG9SET        /* 0xBF82A968 */
  .extern STRIG9INV        /* 0xBF82A96C */
  .extern CAP9             /* 0xBF82A970 */
  .extern CAP9CLR          /* 0xBF82A974 */
  .extern CAP9SET          /* 0xBF82A978 */
  .extern CAP9INV          /* 0xBF82A97C */
  .extern LEBCON9          /* 0xBF82A980 */
  .extern LEBCON9CLR       /* 0xBF82A984 */
  .extern LEBCON9SET       /* 0xBF82A988 */
  .extern LEBCON9INV       /* 0xBF82A98C */
  .extern LEBDLY9          /* 0xBF82A990 */
  .extern LEBDLY9CLR       /* 0xBF82A994 */
  .extern LEBDLY9SET       /* 0xBF82A998 */
  .extern LEBDLY9INV       /* 0xBF82A99C */
  .extern AUXCON9          /* 0xBF82A9A0 */
  .extern AUXCON9CLR       /* 0xBF82A9A4 */
  .extern AUXCON9SET       /* 0xBF82A9A8 */
  .extern AUXCON9INV       /* 0xBF82A9AC */
  .extern PTMR9            /* 0xBF82A9B0 */
  .extern PTMR9CLR         /* 0xBF82A9B4 */
  .extern PTMR9SET         /* 0xBF82A9B8 */
  .extern PTMR9INV         /* 0xBF82A9BC */
  .extern QEI1CON          /* 0xBF82B200 */
  .extern QEI1CONCLR       /* 0xBF82B204 */
  .extern QEI1CONSET       /* 0xBF82B208 */
  .extern QEI1CONINV       /* 0xBF82B20C */
  .extern QEI1IOC          /* 0xBF82B210 */
  .extern QEI1IOCCLR       /* 0xBF82B214 */
  .extern QEI1IOCSET       /* 0xBF82B218 */
  .extern QEI1IOCINV       /* 0xBF82B21C */
  .extern QEI1STAT         /* 0xBF82B220 */
  .extern QEI1STATCLR      /* 0xBF82B224 */
  .extern QEI1STATSET      /* 0xBF82B228 */
  .extern QEI1STATINV      /* 0xBF82B22C */
  .extern POS1CNT          /* 0xBF82B230 */
  .extern POS1CNTCLR       /* 0xBF82B234 */
  .extern POS1CNTSET       /* 0xBF82B238 */
  .extern POS1CNTINV       /* 0xBF82B23C */
  .extern POS1HLD          /* 0xBF82B240 */
  .extern POS1HLDCLR       /* 0xBF82B244 */
  .extern POS1HLDSET       /* 0xBF82B248 */
  .extern POS1HLDINV       /* 0xBF82B24C */
  .extern VEL1CNT          /* 0xBF82B250 */
  .extern VEL1CNTCLR       /* 0xBF82B254 */
  .extern VEL1CNTSET       /* 0xBF82B258 */
  .extern VEL1CNTINV       /* 0xBF82B25C */
  .extern VEL1HLD          /* 0xBF82B260 */
  .extern VEL1HLDCLR       /* 0xBF82B264 */
  .extern VEL1HLDSET       /* 0xBF82B268 */
  .extern VEL1HLDINV       /* 0xBF82B26C */
  .extern INT1TMR          /* 0xBF82B270 */
  .extern INT1TMRCLR       /* 0xBF82B274 */
  .extern INT1TMRSET       /* 0xBF82B278 */
  .extern INT1TMRINV       /* 0xBF82B27C */
  .extern INT1HLD          /* 0xBF82B280 */
  .extern INT1HLDCLR       /* 0xBF82B284 */
  .extern INT1HLDSET       /* 0xBF82B288 */
  .extern INT1HLDINV       /* 0xBF82B28C */
  .extern INDX1CNT         /* 0xBF82B290 */
  .extern INDX1CNTCLR      /* 0xBF82B294 */
  .extern INDX1CNTSET      /* 0xBF82B298 */
  .extern INDX1CNTINV      /* 0xBF82B29C */
  .extern INDX1HLD         /* 0xBF82B2A0 */
  .extern INDX1HLDCLR      /* 0xBF82B2A4 */
  .extern INDX1HLDSET      /* 0xBF82B2A8 */
  .extern INDX1HLDINV      /* 0xBF82B2AC */
  .extern QEI1ICC          /* 0xBF82B2B0 */
  .extern QEI1ICCCLR       /* 0xBF82B2B4 */
  .extern QEI1ICCSET       /* 0xBF82B2B8 */
  .extern QEI1ICCINV       /* 0xBF82B2BC */
  .extern QEI1CMPL         /* 0xBF82B2C0 */
  .extern QEI1CMPLCLR      /* 0xBF82B2C4 */
  .extern QEI1CMPLSET      /* 0xBF82B2C8 */
  .extern QEI1CMPLINV      /* 0xBF82B2CC */
  .extern QEI2CON          /* 0xBF82B400 */
  .extern QEI2CONCLR       /* 0xBF82B404 */
  .extern QEI2CONSET       /* 0xBF82B408 */
  .extern QEI2CONINV       /* 0xBF82B40C */
  .extern QEI2IOC          /* 0xBF82B410 */
  .extern QEI2IOCCLR       /* 0xBF82B414 */
  .extern QEI2IOCSET       /* 0xBF82B418 */
  .extern QEI2IOCINV       /* 0xBF82B41C */
  .extern QEI2STAT         /* 0xBF82B420 */
  .extern QEI2STATCLR      /* 0xBF82B424 */
  .extern QEI2STATSET      /* 0xBF82B428 */
  .extern QEI2STATINV      /* 0xBF82B42C */
  .extern POS2CNT          /* 0xBF82B430 */
  .extern POS2CNTCLR       /* 0xBF82B434 */
  .extern POS2CNTSET       /* 0xBF82B438 */
  .extern POS2CNTINV       /* 0xBF82B43C */
  .extern POS2HLD          /* 0xBF82B440 */
  .extern POS2HLDCLR       /* 0xBF82B444 */
  .extern POS2HLDSET       /* 0xBF82B448 */
  .extern POS2HLDINV       /* 0xBF82B44C */
  .extern VEL2CNT          /* 0xBF82B450 */
  .extern VEL2CNTCLR       /* 0xBF82B454 */
  .extern VEL2CNTSET       /* 0xBF82B458 */
  .extern VEL2CNTINV       /* 0xBF82B45C */
  .extern VEL2HLD          /* 0xBF82B460 */
  .extern VEL2HLDCLR       /* 0xBF82B464 */
  .extern VEL2HLDSET       /* 0xBF82B468 */
  .extern VEL2HLDINV       /* 0xBF82B46C */
  .extern INT2TMR          /* 0xBF82B470 */
  .extern INT2TMRCLR       /* 0xBF82B474 */
  .extern INT2TMRSET       /* 0xBF82B478 */
  .extern INT2TMRINV       /* 0xBF82B47C */
  .extern INT2HLD          /* 0xBF82B480 */
  .extern INT2HLDCLR       /* 0xBF82B484 */
  .extern INT2HLDSET       /* 0xBF82B488 */
  .extern INT2HLDINV       /* 0xBF82B48C */
  .extern INDX2CNT         /* 0xBF82B490 */
  .extern INDX2CNTCLR      /* 0xBF82B494 */
  .extern INDX2CNTSET      /* 0xBF82B498 */
  .extern INDX2CNTINV      /* 0xBF82B49C */
  .extern INDX2HLD         /* 0xBF82B4A0 */
  .extern INDX2HLDCLR      /* 0xBF82B4A4 */
  .extern INDX2HLDSET      /* 0xBF82B4A8 */
  .extern INDX2HLDINV      /* 0xBF82B4AC */
  .extern QEI2ICC          /* 0xBF82B4B0 */
  .extern QEI2ICCCLR       /* 0xBF82B4B4 */
  .extern QEI2ICCSET       /* 0xBF82B4B8 */
  .extern QEI2ICCINV       /* 0xBF82B4BC */
  .extern QEI2CMPL         /* 0xBF82B4C0 */
  .extern QEI2CMPLCLR      /* 0xBF82B4C4 */
  .extern QEI2CMPLSET      /* 0xBF82B4C8 */
  .extern QEI2CMPLINV      /* 0xBF82B4CC */
  .extern QEI3CON          /* 0xBF82B600 */
  .extern QEI3CONCLR       /* 0xBF82B604 */
  .extern QEI3CONSET       /* 0xBF82B608 */
  .extern QEI3CONINV       /* 0xBF82B60C */
  .extern QEI3IOC          /* 0xBF82B610 */
  .extern QEI3IOCCLR       /* 0xBF82B614 */
  .extern QEI3IOCSET       /* 0xBF82B618 */
  .extern QEI3IOCINV       /* 0xBF82B61C */
  .extern QEI3STAT         /* 0xBF82B620 */
  .extern QEI3STATCLR      /* 0xBF82B624 */
  .extern QEI3STATSET      /* 0xBF82B628 */
  .extern QEI3STATINV      /* 0xBF82B62C */
  .extern POS3CNT          /* 0xBF82B630 */
  .extern POS3CNTCLR       /* 0xBF82B634 */
  .extern POS3CNTSET       /* 0xBF82B638 */
  .extern POS3CNTINV       /* 0xBF82B63C */
  .extern POS3HLD          /* 0xBF82B640 */
  .extern POS3HLDCLR       /* 0xBF82B644 */
  .extern POS3HLDSET       /* 0xBF82B648 */
  .extern POS3HLDINV       /* 0xBF82B64C */
  .extern VEL3CNT          /* 0xBF82B650 */
  .extern VEL3CNTCLR       /* 0xBF82B654 */
  .extern VEL3CNTSET       /* 0xBF82B658 */
  .extern VEL3CNTINV       /* 0xBF82B65C */
  .extern VEL3HLD          /* 0xBF82B660 */
  .extern VEL3HLDCLR       /* 0xBF82B664 */
  .extern VEL3HLDSET       /* 0xBF82B668 */
  .extern VEL3HLDINV       /* 0xBF82B66C */
  .extern INT3TMR          /* 0xBF82B670 */
  .extern INT3TMRCLR       /* 0xBF82B674 */
  .extern INT3TMRSET       /* 0xBF82B678 */
  .extern INT3TMRINV       /* 0xBF82B67C */
  .extern INT3HLD          /* 0xBF82B680 */
  .extern INT3HLDCLR       /* 0xBF82B684 */
  .extern INT3HLDSET       /* 0xBF82B688 */
  .extern INT3HLDINV       /* 0xBF82B68C */
  .extern INDX3CNT         /* 0xBF82B690 */
  .extern INDX3CNTCLR      /* 0xBF82B694 */
  .extern INDX3CNTSET      /* 0xBF82B698 */
  .extern INDX3CNTINV      /* 0xBF82B69C */
  .extern INDX3HLD         /* 0xBF82B6A0 */
  .extern INDX3HLDCLR      /* 0xBF82B6A4 */
  .extern INDX3HLDSET      /* 0xBF82B6A8 */
  .extern INDX3HLDINV      /* 0xBF82B6AC */
  .extern QEI3ICC          /* 0xBF82B6B0 */
  .extern QEI3ICCCLR       /* 0xBF82B6B4 */
  .extern QEI3ICCSET       /* 0xBF82B6B8 */
  .extern QEI3ICCINV       /* 0xBF82B6BC */
  .extern QEI3CMPL         /* 0xBF82B6C0 */
  .extern QEI3CMPLCLR      /* 0xBF82B6C4 */
  .extern QEI3CMPLSET      /* 0xBF82B6C8 */
  .extern QEI3CMPLINV      /* 0xBF82B6CC */
  .extern CMSTAT           /* 0xBF82C000 */
  .extern CMSTATCLR        /* 0xBF82C004 */
  .extern CMSTATSET        /* 0xBF82C008 */
  .extern CMSTATINV        /* 0xBF82C00C */
  .extern CM1CON           /* 0xBF82C010 */
  .extern CM1CONCLR        /* 0xBF82C014 */
  .extern CM1CONSET        /* 0xBF82C018 */
  .extern CM1CONINV        /* 0xBF82C01C */
  .extern CM1MSKCON        /* 0xBF82C020 */
  .extern CM1MSKCONCLR     /* 0xBF82C024 */
  .extern CM1MSKCONSET     /* 0xBF82C028 */
  .extern CM1MSKCONINV     /* 0xBF82C02C */
  .extern CM2CON           /* 0xBF82C030 */
  .extern CM2CONCLR        /* 0xBF82C034 */
  .extern CM2CONSET        /* 0xBF82C038 */
  .extern CM2CONINV        /* 0xBF82C03C */
  .extern CM2MSKCON        /* 0xBF82C040 */
  .extern CM2MSKCONCLR     /* 0xBF82C044 */
  .extern CM2MSKCONSET     /* 0xBF82C048 */
  .extern CM2MSKCONINV     /* 0xBF82C04C */
  .extern CM3CON           /* 0xBF82C050 */
  .extern CM3CONCLR        /* 0xBF82C054 */
  .extern CM3CONSET        /* 0xBF82C058 */
  .extern CM3CONINV        /* 0xBF82C05C */
  .extern CM3MSKCON        /* 0xBF82C060 */
  .extern CM3MSKCONCLR     /* 0xBF82C064 */
  .extern CM3MSKCONSET     /* 0xBF82C068 */
  .extern CM3MSKCONINV     /* 0xBF82C06C */
  .extern CM4CON           /* 0xBF82C070 */
  .extern CM4CONCLR        /* 0xBF82C074 */
  .extern CM4CONSET        /* 0xBF82C078 */
  .extern CM4CONINV        /* 0xBF82C07C */
  .extern CM4MSKCON        /* 0xBF82C080 */
  .extern CM4MSKCONCLR     /* 0xBF82C084 */
  .extern CM4MSKCONSET     /* 0xBF82C088 */
  .extern CM4MSKCONINV     /* 0xBF82C08C */
  .extern CM5CON           /* 0xBF82C090 */
  .extern CM5CONCLR        /* 0xBF82C094 */
  .extern CM5CONSET        /* 0xBF82C098 */
  .extern CM5CONINV        /* 0xBF82C09C */
  .extern CM5MSKCON        /* 0xBF82C0A0 */
  .extern CM5MSKCONCLR     /* 0xBF82C0A4 */
  .extern CM5MSKCONSET     /* 0xBF82C0A8 */
  .extern CM5MSKCONINV     /* 0xBF82C0AC */
  .extern DAC1CON          /* 0xBF82C400 */
  .extern DAC1CONCLR       /* 0xBF82C404 */
  .extern DAC1CONSET       /* 0xBF82C408 */
  .extern DAC1CONINV       /* 0xBF82C40C */
  .extern DAC2CON          /* 0xBF82C600 */
  .extern DAC2CONCLR       /* 0xBF82C604 */
  .extern DAC2CONSET       /* 0xBF82C608 */
  .extern DAC2CONINV       /* 0xBF82C60C */
  .extern CTMUCON          /* 0xBF82D000 */
  .extern CTMUCONCLR       /* 0xBF82D004 */
  .extern CTMUCONSET       /* 0xBF82D008 */
  .extern CTMUCONINV       /* 0xBF82D00C */
  .extern CLC1CON          /* 0xBF82D200 */
  .extern CLC1CONCLR       /* 0xBF82D204 */
  .extern CLC1CONSET       /* 0xBF82D208 */
  .extern CLC1CONINV       /* 0xBF82D20C */
  .extern CLC1SEL          /* 0xBF82D210 */
  .extern CLC1SELCLR       /* 0xBF82D214 */
  .extern CLC1SELSET       /* 0xBF82D218 */
  .extern CLC1SELINV       /* 0xBF82D21C */
  .extern CLC1GLS          /* 0xBF82D220 */
  .extern CLC1GLSCLR       /* 0xBF82D224 */
  .extern CLC1GLSSET       /* 0xBF82D228 */
  .extern CLC1GLSINV       /* 0xBF82D22C */
  .extern CLC2CON          /* 0xBF82D400 */
  .extern CLC2CONCLR       /* 0xBF82D404 */
  .extern CLC2CONSET       /* 0xBF82D408 */
  .extern CLC2CONINV       /* 0xBF82D40C */
  .extern CLC2SEL          /* 0xBF82D410 */
  .extern CLC2SELCLR       /* 0xBF82D414 */
  .extern CLC2SELSET       /* 0xBF82D418 */
  .extern CLC2SELINV       /* 0xBF82D41C */
  .extern CLC2GLS          /* 0xBF82D420 */
  .extern CLC2GLSCLR       /* 0xBF82D424 */
  .extern CLC2GLSSET       /* 0xBF82D428 */
  .extern CLC2GLSINV       /* 0xBF82D42C */
  .extern CLC3CON          /* 0xBF82D600 */
  .extern CLC3CONCLR       /* 0xBF82D604 */
  .extern CLC3CONSET       /* 0xBF82D608 */
  .extern CLC3CONINV       /* 0xBF82D60C */
  .extern CLC3SEL          /* 0xBF82D610 */
  .extern CLC3SELCLR       /* 0xBF82D614 */
  .extern CLC3SELSET       /* 0xBF82D618 */
  .extern CLC3SELINV       /* 0xBF82D61C */
  .extern CLC3GLS          /* 0xBF82D620 */
  .extern CLC3GLSCLR       /* 0xBF82D624 */
  .extern CLC3GLSSET       /* 0xBF82D628 */
  .extern CLC3GLSINV       /* 0xBF82D62C */
  .extern CLC4CON          /* 0xBF82D800 */
  .extern CLC4CONCLR       /* 0xBF82D804 */
  .extern CLC4CONSET       /* 0xBF82D808 */
  .extern CLC4CONINV       /* 0xBF82D80C */
  .extern CLC4SEL          /* 0xBF82D810 */
  .extern CLC4SELCLR       /* 0xBF82D814 */
  .extern CLC4SELSET       /* 0xBF82D818 */
  .extern CLC4SELINV       /* 0xBF82D81C */
  .extern CLC4GLS          /* 0xBF82D820 */
  .extern CLC4GLSCLR       /* 0xBF82D824 */
  .extern CLC4GLSSET       /* 0xBF82D828 */
  .extern CLC4GLSINV       /* 0xBF82D82C */
  .extern ANSELA           /* 0xBF860000 */
  .extern ANSELACLR        /* 0xBF860004 */
  .extern ANSELASET        /* 0xBF860008 */
  .extern ANSELAINV        /* 0xBF86000C */
  .extern TRISA            /* 0xBF860010 */
  .extern TRISACLR         /* 0xBF860014 */
  .extern TRISASET         /* 0xBF860018 */
  .extern TRISAINV         /* 0xBF86001C */
  .extern PORTA            /* 0xBF860020 */
  .extern PORTACLR         /* 0xBF860024 */
  .extern PORTASET         /* 0xBF860028 */
  .extern PORTAINV         /* 0xBF86002C */
  .extern LATA             /* 0xBF860030 */
  .extern LATACLR          /* 0xBF860034 */
  .extern LATASET          /* 0xBF860038 */
  .extern LATAINV          /* 0xBF86003C */
  .extern ODCA             /* 0xBF860040 */
  .extern ODCACLR          /* 0xBF860044 */
  .extern ODCASET          /* 0xBF860048 */
  .extern ODCAINV          /* 0xBF86004C */
  .extern CNPUA            /* 0xBF860050 */
  .extern CNPUACLR         /* 0xBF860054 */
  .extern CNPUASET         /* 0xBF860058 */
  .extern CNPUAINV         /* 0xBF86005C */
  .extern CNPDA            /* 0xBF860060 */
  .extern CNPDACLR         /* 0xBF860064 */
  .extern CNPDASET         /* 0xBF860068 */
  .extern CNPDAINV         /* 0xBF86006C */
  .extern CNCONA           /* 0xBF860070 */
  .extern CNCONACLR        /* 0xBF860074 */
  .extern CNCONASET        /* 0xBF860078 */
  .extern CNCONAINV        /* 0xBF86007C */
  .extern CNENA            /* 0xBF860080 */
  .extern CNENACLR         /* 0xBF860084 */
  .extern CNENASET         /* 0xBF860088 */
  .extern CNENAINV         /* 0xBF86008C */
  .extern CNSTATA          /* 0xBF860090 */
  .extern CNSTATACLR       /* 0xBF860094 */
  .extern CNSTATASET       /* 0xBF860098 */
  .extern CNSTATAINV       /* 0xBF86009C */
  .extern CNNEA            /* 0xBF8600A0 */
  .extern CNNEACLR         /* 0xBF8600A4 */
  .extern CNNEASET         /* 0xBF8600A8 */
  .extern CNNEAINV         /* 0xBF8600AC */
  .extern CNFA             /* 0xBF8600B0 */
  .extern CNFACLR          /* 0xBF8600B4 */
  .extern CNFASET          /* 0xBF8600B8 */
  .extern CNFAINV          /* 0xBF8600BC */
  .extern SRCON0A          /* 0xBF8600C0 */
  .extern SRCON0ACLR       /* 0xBF8600C4 */
  .extern SRCON0ASET       /* 0xBF8600C8 */
  .extern SRCON0AINV       /* 0xBF8600CC */
  .extern SRCON1A          /* 0xBF8600D0 */
  .extern SRCON1ACLR       /* 0xBF8600D4 */
  .extern SRCON1ASET       /* 0xBF8600D8 */
  .extern SRCON1AINV       /* 0xBF8600DC */
  .extern ANSELB           /* 0xBF860100 */
  .extern ANSELBCLR        /* 0xBF860104 */
  .extern ANSELBSET        /* 0xBF860108 */
  .extern ANSELBINV        /* 0xBF86010C */
  .extern TRISB            /* 0xBF860110 */
  .extern TRISBCLR         /* 0xBF860114 */
  .extern TRISBSET         /* 0xBF860118 */
  .extern TRISBINV         /* 0xBF86011C */
  .extern PORTB            /* 0xBF860120 */
  .extern PORTBCLR         /* 0xBF860124 */
  .extern PORTBSET         /* 0xBF860128 */
  .extern PORTBINV         /* 0xBF86012C */
  .extern LATB             /* 0xBF860130 */
  .extern LATBCLR          /* 0xBF860134 */
  .extern LATBSET          /* 0xBF860138 */
  .extern LATBINV          /* 0xBF86013C */
  .extern ODCB             /* 0xBF860140 */
  .extern ODCBCLR          /* 0xBF860144 */
  .extern ODCBSET          /* 0xBF860148 */
  .extern ODCBINV          /* 0xBF86014C */
  .extern CNPUB            /* 0xBF860150 */
  .extern CNPUBCLR         /* 0xBF860154 */
  .extern CNPUBSET         /* 0xBF860158 */
  .extern CNPUBINV         /* 0xBF86015C */
  .extern CNPDB            /* 0xBF860160 */
  .extern CNPDBCLR         /* 0xBF860164 */
  .extern CNPDBSET         /* 0xBF860168 */
  .extern CNPDBINV         /* 0xBF86016C */
  .extern CNCONB           /* 0xBF860170 */
  .extern CNCONBCLR        /* 0xBF860174 */
  .extern CNCONBSET        /* 0xBF860178 */
  .extern CNCONBINV        /* 0xBF86017C */
  .extern CNENB            /* 0xBF860180 */
  .extern CNENBCLR         /* 0xBF860184 */
  .extern CNENBSET         /* 0xBF860188 */
  .extern CNENBINV         /* 0xBF86018C */
  .extern CNSTATB          /* 0xBF860190 */
  .extern CNSTATBCLR       /* 0xBF860194 */
  .extern CNSTATBSET       /* 0xBF860198 */
  .extern CNSTATBINV       /* 0xBF86019C */
  .extern CNNEB            /* 0xBF8601A0 */
  .extern CNNEBCLR         /* 0xBF8601A4 */
  .extern CNNEBSET         /* 0xBF8601A8 */
  .extern CNNEBINV         /* 0xBF8601AC */
  .extern CNFB             /* 0xBF8601B0 */
  .extern CNFBCLR          /* 0xBF8601B4 */
  .extern CNFBSET          /* 0xBF8601B8 */
  .extern CNFBINV          /* 0xBF8601BC */
  .extern SRCON0B          /* 0xBF8601C0 */
  .extern SRCON0BCLR       /* 0xBF8601C4 */
  .extern SRCON0BSET       /* 0xBF8601C8 */
  .extern SRCON0BINV       /* 0xBF8601CC */
  .extern SRCON1B          /* 0xBF8601D0 */
  .extern SRCON1BCLR       /* 0xBF8601D4 */
  .extern SRCON1BSET       /* 0xBF8601D8 */
  .extern SRCON1BINV       /* 0xBF8601DC */
  .extern ANSELC           /* 0xBF860200 */
  .extern ANSELCCLR        /* 0xBF860204 */
  .extern ANSELCSET        /* 0xBF860208 */
  .extern ANSELCINV        /* 0xBF86020C */
  .extern TRISC            /* 0xBF860210 */
  .extern TRISCCLR         /* 0xBF860214 */
  .extern TRISCSET         /* 0xBF860218 */
  .extern TRISCINV         /* 0xBF86021C */
  .extern PORTC            /* 0xBF860220 */
  .extern PORTCCLR         /* 0xBF860224 */
  .extern PORTCSET         /* 0xBF860228 */
  .extern PORTCINV         /* 0xBF86022C */
  .extern LATC             /* 0xBF860230 */
  .extern LATCCLR          /* 0xBF860234 */
  .extern LATCSET          /* 0xBF860238 */
  .extern LATCINV          /* 0xBF86023C */
  .extern ODCC             /* 0xBF860240 */
  .extern ODCCCLR          /* 0xBF860244 */
  .extern ODCCSET          /* 0xBF860248 */
  .extern ODCCINV          /* 0xBF86024C */
  .extern CNPUC            /* 0xBF860250 */
  .extern CNPUCCLR         /* 0xBF860254 */
  .extern CNPUCSET         /* 0xBF860258 */
  .extern CNPUCINV         /* 0xBF86025C */
  .extern CNPDC            /* 0xBF860260 */
  .extern CNPDCCLR         /* 0xBF860264 */
  .extern CNPDCSET         /* 0xBF860268 */
  .extern CNPDCINV         /* 0xBF86026C */
  .extern CNCONC           /* 0xBF860270 */
  .extern CNCONCCLR        /* 0xBF860274 */
  .extern CNCONCSET        /* 0xBF860278 */
  .extern CNCONCINV        /* 0xBF86027C */
  .extern CNENC            /* 0xBF860280 */
  .extern CNENCCLR         /* 0xBF860284 */
  .extern CNENCSET         /* 0xBF860288 */
  .extern CNENCINV         /* 0xBF86028C */
  .extern CNSTATC          /* 0xBF860290 */
  .extern CNSTATCCLR       /* 0xBF860294 */
  .extern CNSTATCSET       /* 0xBF860298 */
  .extern CNSTATCINV       /* 0xBF86029C */
  .extern CNNEC            /* 0xBF8602A0 */
  .extern CNNECCLR         /* 0xBF8602A4 */
  .extern CNNECSET         /* 0xBF8602A8 */
  .extern CNNECINV         /* 0xBF8602AC */
  .extern CNFC             /* 0xBF8602B0 */
  .extern CNFCCLR          /* 0xBF8602B4 */
  .extern CNFCSET          /* 0xBF8602B8 */
  .extern CNFCINV          /* 0xBF8602BC */
  .extern SRCON0C          /* 0xBF8602C0 */
  .extern SRCON0CCLR       /* 0xBF8602C4 */
  .extern SRCON0CSET       /* 0xBF8602C8 */
  .extern SRCON0CINV       /* 0xBF8602CC */
  .extern SRCON1C          /* 0xBF8602D0 */
  .extern SRCON1CCLR       /* 0xBF8602D4 */
  .extern SRCON1CSET       /* 0xBF8602D8 */
  .extern SRCON1CINV       /* 0xBF8602DC */
  .extern TRISD            /* 0xBF860310 */
  .extern TRISDCLR         /* 0xBF860314 */
  .extern TRISDSET         /* 0xBF860318 */
  .extern TRISDINV         /* 0xBF86031C */
  .extern PORTD            /* 0xBF860320 */
  .extern PORTDCLR         /* 0xBF860324 */
  .extern PORTDSET         /* 0xBF860328 */
  .extern PORTDINV         /* 0xBF86032C */
  .extern LATD             /* 0xBF860330 */
  .extern LATDCLR          /* 0xBF860334 */
  .extern LATDSET          /* 0xBF860338 */
  .extern LATDINV          /* 0xBF86033C */
  .extern ODCD             /* 0xBF860340 */
  .extern ODCDCLR          /* 0xBF860344 */
  .extern ODCDSET          /* 0xBF860348 */
  .extern ODCDINV          /* 0xBF86034C */
  .extern CNPUD            /* 0xBF860350 */
  .extern CNPUDCLR         /* 0xBF860354 */
  .extern CNPUDSET         /* 0xBF860358 */
  .extern CNPUDINV         /* 0xBF86035C */
  .extern CNPDD            /* 0xBF860360 */
  .extern CNPDDCLR         /* 0xBF860364 */
  .extern CNPDDSET         /* 0xBF860368 */
  .extern CNPDDINV         /* 0xBF86036C */
  .extern CNCOND           /* 0xBF860370 */
  .extern CNCONDCLR        /* 0xBF860374 */
  .extern CNCONDSET        /* 0xBF860378 */
  .extern CNCONDINV        /* 0xBF86037C */
  .extern CNEND            /* 0xBF860380 */
  .extern CNENDCLR         /* 0xBF860384 */
  .extern CNENDSET         /* 0xBF860388 */
  .extern CNENDINV         /* 0xBF86038C */
  .extern CNSTATD          /* 0xBF860390 */
  .extern CNSTATDCLR       /* 0xBF860394 */
  .extern CNSTATDSET       /* 0xBF860398 */
  .extern CNSTATDINV       /* 0xBF86039C */
  .extern CNNED            /* 0xBF8603A0 */
  .extern CNNEDCLR         /* 0xBF8603A4 */
  .extern CNNEDSET         /* 0xBF8603A8 */
  .extern CNNEDINV         /* 0xBF8603AC */
  .extern CNFD             /* 0xBF8603B0 */
  .extern CNFDCLR          /* 0xBF8603B4 */
  .extern CNFDSET          /* 0xBF8603B8 */
  .extern CNFDINV          /* 0xBF8603BC */
  .extern SRCON0D          /* 0xBF8603C0 */
  .extern SRCON0DCLR       /* 0xBF8603C4 */
  .extern SRCON0DSET       /* 0xBF8603C8 */
  .extern SRCON0DINV       /* 0xBF8603CC */
  .extern SRCON1D          /* 0xBF8603D0 */
  .extern SRCON1DCLR       /* 0xBF8603D4 */
  .extern SRCON1DSET       /* 0xBF8603D8 */
  .extern SRCON1DINV       /* 0xBF8603DC */
  .extern ANSELE           /* 0xBF860400 */
  .extern ANSELECLR        /* 0xBF860404 */
  .extern ANSELESET        /* 0xBF860408 */
  .extern ANSELEINV        /* 0xBF86040C */
  .extern TRISE            /* 0xBF860410 */
  .extern TRISECLR         /* 0xBF860414 */
  .extern TRISESET         /* 0xBF860418 */
  .extern TRISEINV         /* 0xBF86041C */
  .extern PORTE            /* 0xBF860420 */
  .extern PORTECLR         /* 0xBF860424 */
  .extern PORTESET         /* 0xBF860428 */
  .extern PORTEINV         /* 0xBF86042C */
  .extern LATE             /* 0xBF860430 */
  .extern LATECLR          /* 0xBF860434 */
  .extern LATESET          /* 0xBF860438 */
  .extern LATEINV          /* 0xBF86043C */
  .extern ODCE             /* 0xBF860440 */
  .extern ODCECLR          /* 0xBF860444 */
  .extern ODCESET          /* 0xBF860448 */
  .extern ODCEINV          /* 0xBF86044C */
  .extern CNPUE            /* 0xBF860450 */
  .extern CNPUECLR         /* 0xBF860454 */
  .extern CNPUESET         /* 0xBF860458 */
  .extern CNPUEINV         /* 0xBF86045C */
  .extern CNPDE            /* 0xBF860460 */
  .extern CNPDECLR         /* 0xBF860464 */
  .extern CNPDESET         /* 0xBF860468 */
  .extern CNPDEINV         /* 0xBF86046C */
  .extern CNCONE           /* 0xBF860470 */
  .extern CNCONECLR        /* 0xBF860474 */
