Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.2.84/include/proc/p32mk0256mcj064.h
#define _IPC28_AD1D6IS_POSITION                  0x00000000
#define _IPC28_AD1D6IS_MASK                      0x00000003
#define _IPC28_AD1D6IS_LENGTH                    0x00000002

#define _IPC28_AD1D6IP_POSITION                  0x00000002
#define _IPC28_AD1D6IP_MASK                      0x0000001C
#define _IPC28_AD1D6IP_LENGTH                    0x00000003

#define _IPC28_AD1D7IS_POSITION                  0x00000008
#define _IPC28_AD1D7IS_MASK                      0x00000300
#define _IPC28_AD1D7IS_LENGTH                    0x00000002

#define _IPC28_AD1D7IP_POSITION                  0x0000000A
#define _IPC28_AD1D7IP_MASK                      0x00001C00
#define _IPC28_AD1D7IP_LENGTH                    0x00000003

#define _IPC28_AD1D8IS_POSITION                  0x00000010
#define _IPC28_AD1D8IS_MASK                      0x00030000
#define _IPC28_AD1D8IS_LENGTH                    0x00000002

#define _IPC28_AD1D8IP_POSITION                  0x00000012
#define _IPC28_AD1D8IP_MASK                      0x001C0000
#define _IPC28_AD1D8IP_LENGTH                    0x00000003

#define _IPC28_AD1D9IS_POSITION                  0x00000018
#define _IPC28_AD1D9IS_MASK                      0x03000000
#define _IPC28_AD1D9IS_LENGTH                    0x00000002

#define _IPC28_AD1D9IP_POSITION                  0x0000001A
#define _IPC28_AD1D9IP_MASK                      0x1C000000
#define _IPC28_AD1D9IP_LENGTH                    0x00000003

#define _IPC28_w_POSITION                        0x00000000
#define _IPC28_w_MASK                            0xFFFFFFFF
#define _IPC28_w_LENGTH                          0x00000020

#define _IPC29_AD1D10IS_POSITION                 0x00000000
#define _IPC29_AD1D10IS_MASK                     0x00000003
#define _IPC29_AD1D10IS_LENGTH                   0x00000002

#define _IPC29_AD1D10IP_POSITION                 0x00000002
#define _IPC29_AD1D10IP_MASK                     0x0000001C
#define _IPC29_AD1D10IP_LENGTH                   0x00000003

#define _IPC29_AD1D11IS_POSITION                 0x00000008
#define _IPC29_AD1D11IS_MASK                     0x00000300
#define _IPC29_AD1D11IS_LENGTH                   0x00000002

#define _IPC29_AD1D11IP_POSITION                 0x0000000A
#define _IPC29_AD1D11IP_MASK                     0x00001C00
#define _IPC29_AD1D11IP_LENGTH                   0x00000003

#define _IPC29_AD1D12IS_POSITION                 0x00000010
#define _IPC29_AD1D12IS_MASK                     0x00030000
#define _IPC29_AD1D12IS_LENGTH                   0x00000002

#define _IPC29_AD1D12IP_POSITION                 0x00000012
#define _IPC29_AD1D12IP_MASK                     0x001C0000
#define _IPC29_AD1D12IP_LENGTH                   0x00000003

#define _IPC29_AD1D13IS_POSITION                 0x00000018
#define _IPC29_AD1D13IS_MASK                     0x03000000
#define _IPC29_AD1D13IS_LENGTH                   0x00000002

#define _IPC29_AD1D13IP_POSITION                 0x0000001A
#define _IPC29_AD1D13IP_MASK                     0x1C000000
#define _IPC29_AD1D13IP_LENGTH                   0x00000003

#define _IPC29_w_POSITION                        0x00000000
#define _IPC29_w_MASK                            0xFFFFFFFF
#define _IPC29_w_LENGTH                          0x00000020

#define _IPC30_AD1D14IS_POSITION                 0x00000000
#define _IPC30_AD1D14IS_MASK                     0x00000003
#define _IPC30_AD1D14IS_LENGTH                   0x00000002

#define _IPC30_AD1D14IP_POSITION                 0x00000002
#define _IPC30_AD1D14IP_MASK                     0x0000001C
#define _IPC30_AD1D14IP_LENGTH                   0x00000003

#define _IPC30_AD1D15IS_POSITION                 0x00000008
#define _IPC30_AD1D15IS_MASK                     0x00000300
#define _IPC30_AD1D15IS_LENGTH                   0x00000002

#define _IPC30_AD1D15IP_POSITION                 0x0000000A
#define _IPC30_AD1D15IP_MASK                     0x00001C00
#define _IPC30_AD1D15IP_LENGTH                   0x00000003

#define _IPC30_AD1D16IS_POSITION                 0x00000010
#define _IPC30_AD1D16IS_MASK                     0x00030000
#define _IPC30_AD1D16IS_LENGTH                   0x00000002

#define _IPC30_AD1D16IP_POSITION                 0x00000012
#define _IPC30_AD1D16IP_MASK                     0x001C0000
#define _IPC30_AD1D16IP_LENGTH                   0x00000003

#define _IPC30_AD1D17IS_POSITION                 0x00000018
#define _IPC30_AD1D17IS_MASK                     0x03000000
#define _IPC30_AD1D17IS_LENGTH                   0x00000002

#define _IPC30_AD1D17IP_POSITION                 0x0000001A
#define _IPC30_AD1D17IP_MASK                     0x1C000000
#define _IPC30_AD1D17IP_LENGTH                   0x00000003

#define _IPC30_w_POSITION                        0x00000000
#define _IPC30_w_MASK                            0xFFFFFFFF
#define _IPC30_w_LENGTH                          0x00000020

#define _IPC31_AD1D18IS_POSITION                 0x00000000
#define _IPC31_AD1D18IS_MASK                     0x00000003
#define _IPC31_AD1D18IS_LENGTH                   0x00000002

#define _IPC31_AD1D18IP_POSITION                 0x00000002
#define _IPC31_AD1D18IP_MASK                     0x0000001C
#define _IPC31_AD1D18IP_LENGTH                   0x00000003

#define _IPC31_AD1D19IS_POSITION                 0x00000008
#define _IPC31_AD1D19IS_MASK                     0x00000300
#define _IPC31_AD1D19IS_LENGTH                   0x00000002

#define _IPC31_AD1D19IP_POSITION                 0x0000000A
#define _IPC31_AD1D19IP_MASK                     0x00001C00
#define _IPC31_AD1D19IP_LENGTH                   0x00000003

#define _IPC31_w_POSITION                        0x00000000
#define _IPC31_w_MASK                            0xFFFFFFFF
#define _IPC31_w_LENGTH                          0x00000020

#define _IPC32_AD1D24IS_POSITION                 0x00000010
#define _IPC32_AD1D24IS_MASK                     0x00030000
#define _IPC32_AD1D24IS_LENGTH                   0x00000002

#define _IPC32_AD1D24IP_POSITION                 0x00000012
#define _IPC32_AD1D24IP_MASK                     0x001C0000
#define _IPC32_AD1D24IP_LENGTH                   0x00000003

#define _IPC32_AD1D25IS_POSITION                 0x00000018
#define _IPC32_AD1D25IS_MASK                     0x03000000
#define _IPC32_AD1D25IS_LENGTH                   0x00000002

#define _IPC32_AD1D25IP_POSITION                 0x0000001A
#define _IPC32_AD1D25IP_MASK                     0x1C000000
#define _IPC32_AD1D25IP_LENGTH                   0x00000003

#define _IPC32_w_POSITION                        0x00000000
#define _IPC32_w_MASK                            0xFFFFFFFF
#define _IPC32_w_LENGTH                          0x00000020

#define _IPC33_AD1D26IS_POSITION                 0x00000000
#define _IPC33_AD1D26IS_MASK                     0x00000003
#define _IPC33_AD1D26IS_LENGTH                   0x00000002

#define _IPC33_AD1D26IP_POSITION                 0x00000002
#define _IPC33_AD1D26IP_MASK                     0x0000001C
#define _IPC33_AD1D26IP_LENGTH                   0x00000003

#define _IPC33_AD1D27IS_POSITION                 0x00000008
#define _IPC33_AD1D27IS_MASK                     0x00000300
#define _IPC33_AD1D27IS_LENGTH                   0x00000002

#define _IPC33_AD1D27IP_POSITION                 0x0000000A
#define _IPC33_AD1D27IP_MASK                     0x00001C00
#define _IPC33_AD1D27IP_LENGTH                   0x00000003

#define _IPC33_w_POSITION                        0x00000000
#define _IPC33_w_MASK                            0xFFFFFFFF
#define _IPC33_w_LENGTH                          0x00000020

#define _IPC34_w_POSITION                        0x00000000
#define _IPC34_w_MASK                            0xFFFFFFFF
#define _IPC34_w_LENGTH                          0x00000020

#define _IPC36_AD1D40IS_POSITION                 0x00000010
#define _IPC36_AD1D40IS_MASK                     0x00030000
#define _IPC36_AD1D40IS_LENGTH                   0x00000002

#define _IPC36_AD1D40IP_POSITION                 0x00000012
#define _IPC36_AD1D40IP_MASK                     0x001C0000
#define _IPC36_AD1D40IP_LENGTH                   0x00000003

#define _IPC36_AD1D41IS_POSITION                 0x00000018
#define _IPC36_AD1D41IS_MASK                     0x03000000
#define _IPC36_AD1D41IS_LENGTH                   0x00000002

#define _IPC36_AD1D41IP_POSITION                 0x0000001A
#define _IPC36_AD1D41IP_MASK                     0x1C000000
#define _IPC36_AD1D41IP_LENGTH                   0x00000003

#define _IPC36_w_POSITION                        0x00000000
#define _IPC36_w_MASK                            0xFFFFFFFF
#define _IPC36_w_LENGTH                          0x00000020

#define _IPC38_AD1D46IS_POSITION                 0x00000000
#define _IPC38_AD1D46IS_MASK                     0x00000003
#define _IPC38_AD1D46IS_LENGTH                   0x00000002

#define _IPC38_AD1D46IP_POSITION                 0x00000002
#define _IPC38_AD1D46IP_MASK                     0x0000001C
#define _IPC38_AD1D46IP_LENGTH                   0x00000003

#define _IPC38_AD1D47IS_POSITION                 0x00000008
#define _IPC38_AD1D47IS_MASK                     0x00000300
#define _IPC38_AD1D47IS_LENGTH                   0x00000002

#define _IPC38_AD1D47IP_POSITION                 0x0000000A
#define _IPC38_AD1D47IP_MASK                     0x00001C00
#define _IPC38_AD1D47IP_LENGTH                   0x00000003

