Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.2.84/include/proc/p32mk0256mcj064.h
#define _OFF061_VOFF_POSITION                    0x00000001
#define _OFF061_VOFF_MASK                        0x0003FFFE
#define _OFF061_VOFF_LENGTH                      0x00000011

#define _OFF071_VOFF_POSITION                    0x00000001
#define _OFF071_VOFF_MASK                        0x0003FFFE
#define _OFF071_VOFF_LENGTH                      0x00000011

#define _OFF072_VOFF_POSITION                    0x00000001
#define _OFF072_VOFF_MASK                        0x0003FFFE
#define _OFF072_VOFF_LENGTH                      0x00000011

#define _OFF073_VOFF_POSITION                    0x00000001
#define _OFF073_VOFF_MASK                        0x0003FFFE
#define _OFF073_VOFF_LENGTH                      0x00000011

#define _OFF074_VOFF_POSITION                    0x00000001
#define _OFF074_VOFF_MASK                        0x0003FFFE
#define _OFF074_VOFF_LENGTH                      0x00000011

#define _OFF075_VOFF_POSITION                    0x00000001
#define _OFF075_VOFF_MASK                        0x0003FFFE
#define _OFF075_VOFF_LENGTH                      0x00000011

#define _OFF076_VOFF_POSITION                    0x00000001
#define _OFF076_VOFF_MASK                        0x0003FFFE
#define _OFF076_VOFF_LENGTH                      0x00000011

#define _OFF077_VOFF_POSITION                    0x00000001
#define _OFF077_VOFF_MASK                        0x0003FFFE
#define _OFF077_VOFF_LENGTH                      0x00000011

#define _OFF078_VOFF_POSITION                    0x00000001
#define _OFF078_VOFF_MASK                        0x0003FFFE
#define _OFF078_VOFF_LENGTH                      0x00000011

#define _OFF079_VOFF_POSITION                    0x00000001
#define _OFF079_VOFF_MASK                        0x0003FFFE
#define _OFF079_VOFF_LENGTH                      0x00000011

#define _OFF080_VOFF_POSITION                    0x00000001
#define _OFF080_VOFF_MASK                        0x0003FFFE
#define _OFF080_VOFF_LENGTH                      0x00000011

#define _OFF081_VOFF_POSITION                    0x00000001
#define _OFF081_VOFF_MASK                        0x0003FFFE
#define _OFF081_VOFF_LENGTH                      0x00000011

#define _OFF082_VOFF_POSITION                    0x00000001
#define _OFF082_VOFF_MASK                        0x0003FFFE
#define _OFF082_VOFF_LENGTH                      0x00000011

#define _OFF083_VOFF_POSITION                    0x00000001
#define _OFF083_VOFF_MASK                        0x0003FFFE
#define _OFF083_VOFF_LENGTH                      0x00000011

#define _OFF084_VOFF_POSITION                    0x00000001
#define _OFF084_VOFF_MASK                        0x0003FFFE
#define _OFF084_VOFF_LENGTH                      0x00000011

#define _OFF085_VOFF_POSITION                    0x00000001
#define _OFF085_VOFF_MASK                        0x0003FFFE
#define _OFF085_VOFF_LENGTH                      0x00000011

#define _OFF086_VOFF_POSITION                    0x00000001
#define _OFF086_VOFF_MASK                        0x0003FFFE
#define _OFF086_VOFF_LENGTH                      0x00000011

#define _OFF087_VOFF_POSITION                    0x00000001
#define _OFF087_VOFF_MASK                        0x0003FFFE
#define _OFF087_VOFF_LENGTH                      0x00000011

#define _OFF088_VOFF_POSITION                    0x00000001
#define _OFF088_VOFF_MASK                        0x0003FFFE
#define _OFF088_VOFF_LENGTH                      0x00000011

#define _OFF089_VOFF_POSITION                    0x00000001
#define _OFF089_VOFF_MASK                        0x0003FFFE
#define _OFF089_VOFF_LENGTH                      0x00000011

#define _OFF090_VOFF_POSITION                    0x00000001
#define _OFF090_VOFF_MASK                        0x0003FFFE
#define _OFF090_VOFF_LENGTH                      0x00000011

#define _OFF091_VOFF_POSITION                    0x00000001
#define _OFF091_VOFF_MASK                        0x0003FFFE
#define _OFF091_VOFF_LENGTH                      0x00000011

#define _OFF092_VOFF_POSITION                    0x00000001
#define _OFF092_VOFF_MASK                        0x0003FFFE
#define _OFF092_VOFF_LENGTH                      0x00000011

#define _OFF094_VOFF_POSITION                    0x00000001
#define _OFF094_VOFF_MASK                        0x0003FFFE
#define _OFF094_VOFF_LENGTH                      0x00000011

#define _OFF095_VOFF_POSITION                    0x00000001
#define _OFF095_VOFF_MASK                        0x0003FFFE
#define _OFF095_VOFF_LENGTH                      0x00000011

#define _OFF096_VOFF_POSITION                    0x00000001
#define _OFF096_VOFF_MASK                        0x0003FFFE
#define _OFF096_VOFF_LENGTH                      0x00000011

#define _OFF097_VOFF_POSITION                    0x00000001
#define _OFF097_VOFF_MASK                        0x0003FFFE
#define _OFF097_VOFF_LENGTH                      0x00000011

#define _OFF098_VOFF_POSITION                    0x00000001
#define _OFF098_VOFF_MASK                        0x0003FFFE
#define _OFF098_VOFF_LENGTH                      0x00000011

#define _OFF099_VOFF_POSITION                    0x00000001
#define _OFF099_VOFF_MASK                        0x0003FFFE
#define _OFF099_VOFF_LENGTH                      0x00000011

#define _OFF100_VOFF_POSITION                    0x00000001
#define _OFF100_VOFF_MASK                        0x0003FFFE
#define _OFF100_VOFF_LENGTH                      0x00000011

#define _OFF101_VOFF_POSITION                    0x00000001
#define _OFF101_VOFF_MASK                        0x0003FFFE
#define _OFF101_VOFF_LENGTH                      0x00000011

#define _OFF102_VOFF_POSITION                    0x00000001
#define _OFF102_VOFF_MASK                        0x0003FFFE
#define _OFF102_VOFF_LENGTH                      0x00000011

#define _OFF103_VOFF_POSITION                    0x00000001
#define _OFF103_VOFF_MASK                        0x0003FFFE
#define _OFF103_VOFF_LENGTH                      0x00000011

#define _OFF104_VOFF_POSITION                    0x00000001
#define _OFF104_VOFF_MASK                        0x0003FFFE
#define _OFF104_VOFF_LENGTH                      0x00000011

#define _OFF105_VOFF_POSITION                    0x00000001
#define _OFF105_VOFF_MASK                        0x0003FFFE
#define _OFF105_VOFF_LENGTH                      0x00000011

