Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.2.84/include/proc/p32mk0256mcj064.h
#define _PDC5_PDC_POSITION                       0x00000000
#define _PDC5_PDC_MASK                           0x0000FFFF
#define _PDC5_PDC_LENGTH                         0x00000010

#define _SDC5_SDC_POSITION                       0x00000000
#define _SDC5_SDC_MASK                           0x0000FFFF
#define _SDC5_SDC_LENGTH                         0x00000010

#define _PHASE5_PHASE_POSITION                   0x00000000
#define _PHASE5_PHASE_MASK                       0x0000FFFF
#define _PHASE5_PHASE_LENGTH                     0x00000010

#define _DTR5_DTR_POSITION                       0x00000000
#define _DTR5_DTR_MASK                           0x0000FFFF
#define _DTR5_DTR_LENGTH                         0x00000010

#define _ALTDTR5_ALTDTR_POSITION                 0x00000000
#define _ALTDTR5_ALTDTR_MASK                     0x0000FFFF
#define _ALTDTR5_ALTDTR_LENGTH                   0x00000010

#define _DTCOMP5_COMP_POSITION                   0x00000000
#define _DTCOMP5_COMP_MASK                       0x00003FFF
#define _DTCOMP5_COMP_LENGTH                     0x0000000E

#define _TRIG5_TRGCMP_POSITION                   0x00000000
#define _TRIG5_TRGCMP_MASK                       0x0000FFFF
#define _TRIG5_TRGCMP_LENGTH                     0x00000010

#define _TRGCON5_STRGIS_POSITION                 0x00000006
#define _TRGCON5_STRGIS_MASK                     0x00000040
#define _TRGCON5_STRGIS_LENGTH                   0x00000001

#define _TRGCON5_DTM_POSITION                    0x00000007
#define _TRGCON5_DTM_MASK                        0x00000080
#define _TRGCON5_DTM_LENGTH                      0x00000001

#define _TRGCON5_STRGSEL_POSITION                0x00000008
#define _TRGCON5_STRGSEL_MASK                    0x00000300
#define _TRGCON5_STRGSEL_LENGTH                  0x00000002

#define _TRGCON5_TRGSEL_POSITION                 0x0000000A
#define _TRGCON5_TRGSEL_MASK                     0x00000C00
#define _TRGCON5_TRGSEL_LENGTH                   0x00000002

#define _TRGCON5_TRGDIV_POSITION                 0x0000000C
#define _TRGCON5_TRGDIV_MASK                     0x0000F000
#define _TRGCON5_TRGDIV_LENGTH                   0x00000004

#define _STRIG5_STRGCMP_POSITION                 0x00000000
#define _STRIG5_STRGCMP_MASK                     0x0000FFFF
#define _STRIG5_STRGCMP_LENGTH                   0x00000010

#define _CAP5_CAP_POSITION                       0x00000000
#define _CAP5_CAP_MASK                           0x0000FFFF
#define _CAP5_CAP_LENGTH                         0x00000010

#define _LEBCON5_CLLEBEN_POSITION                0x0000000A
#define _LEBCON5_CLLEBEN_MASK                    0x00000400
#define _LEBCON5_CLLEBEN_LENGTH                  0x00000001

#define _LEBCON5_FLTLEBEN_POSITION               0x0000000B
#define _LEBCON5_FLTLEBEN_MASK                   0x00000800
#define _LEBCON5_FLTLEBEN_LENGTH                 0x00000001

#define _LEBCON5_PLF_POSITION                    0x0000000C
#define _LEBCON5_PLF_MASK                        0x00001000
#define _LEBCON5_PLF_LENGTH                      0x00000001

#define _LEBCON5_PLR_POSITION                    0x0000000D
#define _LEBCON5_PLR_MASK                        0x00002000
#define _LEBCON5_PLR_LENGTH                      0x00000001

#define _LEBCON5_PHF_POSITION                    0x0000000E
#define _LEBCON5_PHF_MASK                        0x00004000
#define _LEBCON5_PHF_LENGTH                      0x00000001

#define _LEBCON5_PHR_POSITION                    0x0000000F
#define _LEBCON5_PHR_MASK                        0x00008000
#define _LEBCON5_PHR_LENGTH                      0x00000001

#define _LEBDLY5_LEB_POSITION                    0x00000000
#define _LEBDLY5_LEB_MASK                        0x00000FFF
#define _LEBDLY5_LEB_LENGTH                      0x0000000C

#define _AUXCON5_CHOPLEN_POSITION                0x00000000
#define _AUXCON5_CHOPLEN_MASK                    0x00000001
#define _AUXCON5_CHOPLEN_LENGTH                  0x00000001

#define _AUXCON5_CHOPHEN_POSITION                0x00000001
#define _AUXCON5_CHOPHEN_MASK                    0x00000002
#define _AUXCON5_CHOPHEN_LENGTH                  0x00000001

#define _AUXCON5_CHOPSEL_POSITION                0x00000002
#define _AUXCON5_CHOPSEL_MASK                    0x0000003C
#define _AUXCON5_CHOPSEL_LENGTH                  0x00000004

#define _PTMR5_TMR_POSITION                      0x00000000
#define _PTMR5_TMR_MASK                          0x0000FFFF
#define _PTMR5_TMR_LENGTH                        0x00000010

#define _PWMCON6_XPRES_POSITION                  0x00000001
#define _PWMCON6_XPRES_MASK                      0x00000002
#define _PWMCON6_XPRES_LENGTH                    0x00000001

#define _PWMCON6_MTBS_POSITION                   0x00000003
#define _PWMCON6_MTBS_MASK                       0x00000008
#define _PWMCON6_MTBS_LENGTH                     0x00000001

#define _PWMCON6_PTDIR_POSITION                  0x00000004
#define _PWMCON6_PTDIR_MASK                      0x00000010
#define _PWMCON6_PTDIR_LENGTH                    0x00000001

#define _PWMCON6_DTCP_POSITION                   0x00000005
#define _PWMCON6_DTCP_MASK                       0x00000020
#define _PWMCON6_DTCP_LENGTH                     0x00000001

#define _PWMCON6_DTC_POSITION                    0x00000006
#define _PWMCON6_DTC_MASK                        0x000000C0
#define _PWMCON6_DTC_LENGTH                      0x00000002

#define _PWMCON6_ITB_POSITION                    0x00000009
#define _PWMCON6_ITB_MASK                        0x00000200
#define _PWMCON6_ITB_LENGTH                      0x00000001

#define _PWMCON6_ECAM_POSITION                   0x0000000A
#define _PWMCON6_ECAM_MASK                       0x00000C00
#define _PWMCON6_ECAM_LENGTH                     0x00000002

#define _PWMCON6_CLTSTAT_POSITION                0x0000000E
#define _PWMCON6_CLTSTAT_MASK                    0x00004000
#define _PWMCON6_CLTSTAT_LENGTH                  0x00000001

#define _PWMCON6_FLTSTAT_POSITION                0x0000000F
#define _PWMCON6_FLTSTAT_MASK                    0x00008000
#define _PWMCON6_FLTSTAT_LENGTH                  0x00000001

#define _PWMCON6_PWMHIEN_POSITION                0x00000013
#define _PWMCON6_PWMHIEN_MASK                    0x00080000
#define _PWMCON6_PWMHIEN_LENGTH                  0x00000001

#define _PWMCON6_PWMLIEN_POSITION                0x00000014
#define _PWMCON6_PWMLIEN_MASK                    0x00100000
#define _PWMCON6_PWMLIEN_LENGTH                  0x00000001

