Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.2.84/include/proc/p32mk0256mcj064.h
#define _CNPUE_CNPUE12_POSITION                  0x0000000C
#define _CNPUE_CNPUE12_MASK                      0x00001000
#define _CNPUE_CNPUE12_LENGTH                    0x00000001

#define _CNPUE_CNPUE13_POSITION                  0x0000000D
#define _CNPUE_CNPUE13_MASK                      0x00002000
#define _CNPUE_CNPUE13_LENGTH                    0x00000001

#define _CNPUE_CNPUE14_POSITION                  0x0000000E
#define _CNPUE_CNPUE14_MASK                      0x00004000
#define _CNPUE_CNPUE14_LENGTH                    0x00000001

#define _CNPUE_CNPUE15_POSITION                  0x0000000F
#define _CNPUE_CNPUE15_MASK                      0x00008000
#define _CNPUE_CNPUE15_LENGTH                    0x00000001

#define _CNPUE_w_POSITION                        0x00000000
#define _CNPUE_w_MASK                            0xFFFFFFFF
#define _CNPUE_w_LENGTH                          0x00000020

#define _CNPDE_CNPDE0_POSITION                   0x00000000
#define _CNPDE_CNPDE0_MASK                       0x00000001
#define _CNPDE_CNPDE0_LENGTH                     0x00000001

#define _CNPDE_CNPDE1_POSITION                   0x00000001
#define _CNPDE_CNPDE1_MASK                       0x00000002
#define _CNPDE_CNPDE1_LENGTH                     0x00000001

#define _CNPDE_CNPDE8_POSITION                   0x00000008
#define _CNPDE_CNPDE8_MASK                       0x00000100
#define _CNPDE_CNPDE8_LENGTH                     0x00000001

#define _CNPDE_CNPDE9_POSITION                   0x00000009
#define _CNPDE_CNPDE9_MASK                       0x00000200
#define _CNPDE_CNPDE9_LENGTH                     0x00000001

#define _CNPDE_CNPDE12_POSITION                  0x0000000C
#define _CNPDE_CNPDE12_MASK                      0x00001000
#define _CNPDE_CNPDE12_LENGTH                    0x00000001

#define _CNPDE_CNPDE13_POSITION                  0x0000000D
#define _CNPDE_CNPDE13_MASK                      0x00002000
#define _CNPDE_CNPDE13_LENGTH                    0x00000001

#define _CNPDE_CNPDE14_POSITION                  0x0000000E
#define _CNPDE_CNPDE14_MASK                      0x00004000
#define _CNPDE_CNPDE14_LENGTH                    0x00000001

#define _CNPDE_CNPDE15_POSITION                  0x0000000F
#define _CNPDE_CNPDE15_MASK                      0x00008000
#define _CNPDE_CNPDE15_LENGTH                    0x00000001

#define _CNPDE_w_POSITION                        0x00000000
#define _CNPDE_w_MASK                            0xFFFFFFFF
#define _CNPDE_w_LENGTH                          0x00000020

#define _CNCONE_EDGEDETECT_POSITION              0x0000000B
#define _CNCONE_EDGEDETECT_MASK                  0x00000800
#define _CNCONE_EDGEDETECT_LENGTH                0x00000001

#define _CNCONE_ON_POSITION                      0x0000000F
#define _CNCONE_ON_MASK                          0x00008000
#define _CNCONE_ON_LENGTH                        0x00000001

#define _CNCONE_w_POSITION                       0x00000000
#define _CNCONE_w_MASK                           0xFFFFFFFF
#define _CNCONE_w_LENGTH                         0x00000020

#define _CNENE_CNIEE0_POSITION                   0x00000000
#define _CNENE_CNIEE0_MASK                       0x00000001
#define _CNENE_CNIEE0_LENGTH                     0x00000001

#define _CNENE_CNIEE1_POSITION                   0x00000001
#define _CNENE_CNIEE1_MASK                       0x00000002
#define _CNENE_CNIEE1_LENGTH                     0x00000001

#define _CNENE_CNIEE8_POSITION                   0x00000008
#define _CNENE_CNIEE8_MASK                       0x00000100
#define _CNENE_CNIEE8_LENGTH                     0x00000001

#define _CNENE_CNIEE9_POSITION                   0x00000009
#define _CNENE_CNIEE9_MASK                       0x00000200
#define _CNENE_CNIEE9_LENGTH                     0x00000001

#define _CNENE_CNIEE12_POSITION                  0x0000000C
#define _CNENE_CNIEE12_MASK                      0x00001000
#define _CNENE_CNIEE12_LENGTH                    0x00000001

#define _CNENE_CNIEE13_POSITION                  0x0000000D
#define _CNENE_CNIEE13_MASK                      0x00002000
#define _CNENE_CNIEE13_LENGTH                    0x00000001

#define _CNENE_CNIEE14_POSITION                  0x0000000E
#define _CNENE_CNIEE14_MASK                      0x00004000
#define _CNENE_CNIEE14_LENGTH                    0x00000001

#define _CNENE_CNIEE15_POSITION                  0x0000000F
#define _CNENE_CNIEE15_MASK                      0x00008000
#define _CNENE_CNIEE15_LENGTH                    0x00000001

#define _CNENE_w_POSITION                        0x00000000
#define _CNENE_w_MASK                            0xFFFFFFFF
#define _CNENE_w_LENGTH                          0x00000020

#define _CNSTATE_CNSTATE0_POSITION               0x00000000
#define _CNSTATE_CNSTATE0_MASK                   0x00000001
#define _CNSTATE_CNSTATE0_LENGTH                 0x00000001

#define _CNSTATE_CNSTATE1_POSITION               0x00000001
#define _CNSTATE_CNSTATE1_MASK                   0x00000002
#define _CNSTATE_CNSTATE1_LENGTH                 0x00000001

#define _CNSTATE_CNSTATE8_POSITION               0x00000008
#define _CNSTATE_CNSTATE8_MASK                   0x00000100
#define _CNSTATE_CNSTATE8_LENGTH                 0x00000001

#define _CNSTATE_CNSTATE9_POSITION               0x00000009
#define _CNSTATE_CNSTATE9_MASK                   0x00000200
#define _CNSTATE_CNSTATE9_LENGTH                 0x00000001

#define _CNSTATE_CNSTATE12_POSITION              0x0000000C
#define _CNSTATE_CNSTATE12_MASK                  0x00001000
#define _CNSTATE_CNSTATE12_LENGTH                0x00000001

#define _CNSTATE_CNSTATE13_POSITION              0x0000000D
#define _CNSTATE_CNSTATE13_MASK                  0x00002000
#define _CNSTATE_CNSTATE13_LENGTH                0x00000001

#define _CNSTATE_CNSTATE14_POSITION              0x0000000E
#define _CNSTATE_CNSTATE14_MASK                  0x00004000
#define _CNSTATE_CNSTATE14_LENGTH                0x00000001

#define _CNSTATE_CNSTATE15_POSITION              0x0000000F
#define _CNSTATE_CNSTATE15_MASK                  0x00008000
#define _CNSTATE_CNSTATE15_LENGTH                0x00000001

#define _CNSTATE_w_POSITION                      0x00000000
#define _CNSTATE_w_MASK                          0xFFFFFFFF
#define _CNSTATE_w_LENGTH                        0x00000020

#define _CNNEE_CNNEE0_POSITION                   0x00000000
#define _CNNEE_CNNEE0_MASK                       0x00000001
#define _CNNEE_CNNEE0_LENGTH                     0x00000001

#define _CNNEE_CNNEE1_POSITION                   0x00000001
#define _CNNEE_CNNEE1_MASK                       0x00000002
#define _CNNEE_CNNEE1_LENGTH                     0x00000001

